[
  {
    "path": "posts/2022-11-30-entrega-final/",
    "title": "Entrega Final: Condicionantes de la Participación Ciudadana: Evaluación de Servicios Municipales y Cohesión Vecinal en las Juntas de Vecinos",
    "description": "Entrega Final para el trabajo de ICP5006",
    "author": [
      {
        "name": "Felipe Garrido",
        "url": "https://fgarrido-m.github.io/"
      }
    ],
    "date": "2022-12-05",
    "categories": [
      "Trabajo"
    ],
    "contents": "\nIntroducción y Marco Teórico\nLuego del Estallido Social en 2019, hay un renovado interés en la\nparticipación de la ciudadanía en la política, pues se buscan soluciones\na las problemáticas que generaron las masivas protestas de ese año. La\nforma más básica de participación es la votación (Lijphart, 1997), sin\nembargo es notorio que el porcentaje de voto en Chile fue disminuyendo\nprogresivamente y las muestras de participación ciudadana más básicas a\nno son las más utilizadas por la población (Leibe, Palanza y Sánchez,\n2021). De esta manera, es importante mirar hacia otras formas de\nparticipación ciudadana, sea la protesta o el involucramiento en\norganizaciones de la sociedad civil, que permitan que las personas\nexpresen sus necesidades y se sientan satisfechas con su sistema\npolítico.\nEl enfoque de este trabajo será en la forma de Participación\nCiudadana más organizada en estas organizaciones de la sociedad civil.\nEste interés en particular surge de investigaciones previas sobre la\nparticipación ciudadana en la formación de planes reguladores de dos\ncomunas, que muestran dos razones interesantes para la participación\nciudadana en primer lugar. Por una parte cuando las personas consideran\nque la institución a nivel comunal es de fiar se ven motivadas a\nparticipar, debido que consideran que sus intervenciones si van a ser\nescuchadas. Por otra parte, vemos las teorías que son más apoyadas por\nla literatura (Tilly, 2000 y 2010; White, 2012; Cantillán y Herrera,\n2020), que nos indican que mientras los vecinos tienen mayores\nsimilitudes pueden funcionar de mejor manera en este trabajo coordinado.\nEl planteamiento es que la similitud entre individuos facilita la\ncohesión vecinal y elimina los roces que permiten una mejor comunicación\ny por lo tanto, favorecen la participación. En este trabajo más allá de\nver la similitud, se busca analizar la cohesión vecinal como el\nmecanismo causal bajo el cual funciona las teorías previamente\nmencionadas. El interés del trabajo es finalmente analizar cuál de estas\ndos condicionantes son más relevantes para la efectiva participación de\npersonas en el ámbito subnacional.\nPara esto definimos entonces tres variables de interés para este\ntrabajo:\nA. Participación Ciudadana\ni. Definición\nDe una manera poco elegante la participación ciudadana implica\nnormalmente cualquier forma de participación que vaya más allá del mero\nhecho de votar en las elecciones rutinarias por representantes\npolíticos. Muchas veces es visto como una forma de profundizar la\ndemocracia dentro de les ciudadanes, dando rienda suelta a variadas\nversiones de democracia entre las que se encuentran deliberativa,\ndirecta, agonística, etc. (Smith, 2009). En Chile la experiencia de la\nparticipación ciudadana es mediada por la existencia de la dictadura y\nsu definición de política que lo aleja de la población (De la Fuente,\n2013). La recuperación democrática en Chile implica la inclusión de la\nciudadanía y un esfuerzo explícito por parte de los gobiernos de Lagos y\nBachelet de volver a llevar la democracia a la ciudadanía (De la Fuente,\n2013). Esto refleja las definiciones de democracia participativa que\nplantea Pateman (1970) cuando menciona la importancia de llevar\ninstancias democráticas a espacios cercanos para el común de las\npersonas cómo el lugar de empleo y los barrios. Debido a la dificultad\nchilena de sindicalización, una atadura de la época dictatorial, se toma\nla democracia participativa en esta otra dimensión, siendo importante lo\nterritorial, que se aplica fácilmente a lo que se busca medir en este\ntrabajo: el espacio subnacional.\nii. Operacionalización\nTomando en cuenta la breve definición hecha a sobre la participación\nciudadana en Chile, debemos analizar como es que vamos a medirla. En el\ncaso de este trabajo buscaremos la participación ciudadana en el barrio,\nen el territorio, finalmente en la comuna. Dada la experiencia previa en\notros trabajos, se ha visto como periódicamente se ha desarticulado la\nforma básica de participación ciudadana en Chile: la junta de vecinos.\nLa junta de vecinos tiene una larga data de existencia en el país,\napareciendo en 1887, con la Ley de Organización y Atribuciones\nMunicipales (Cáceres et al, 1983). Dada la historia chilena y la\nimportancia de la junta de vecinos como lugar de participación\ndemocrática primaria, en este trabajo se operacionalizará la\nParticipación Ciudadana como el nivel de participación en juntas de\nvecinos de cada comuna.\nB. Confianza en las\ninstituciones\ni. Definición\nLa fuente teórica de esta variable se encuentra en la idea de la\ncultura política de Almond y Verba (1963). Se define la cultura política\ncomo un conjunto de orientaciones evaluativas, afectivas y cognitivas\nhacia una serie de objetos políticos. Sin embargo hay otros estudios\nneurocientíficos posteriores que hacen dudar de las diferencias reales\nentre lo cognitivo y lo afectivo y su efecto en lo evaluativo (Marcus,\n2013; Eagly y Chaiken, 1998). A pesar de lo anterior, el punto de Almond\ny Verba (1963) se mantiene, particularmente con respecto a los objetos\npolíticos hacia los que se manifiestan estas orientaciones. Para los\nautores son cuatro: 1. La institucionalidad en sí, 2. El rol que tiene\nel individuo dentro de la política, 3. La forma en que se desarrolla la\npolítica y 4. Los outcomes de estos procesos políticos. Además, se\nmenciona que puede haber congruencia entre el tipo de sistema político y\nlas orientaciones que tiene el individuo, sobre todo en términos de\nlealtad o alienación respecto del sistema, dada si las orientaciones son\npositivas o negativas.\nii. Operacionalización\nVemos que el concepto de cultura política de Almond y Verba abarca\nbastantes aspectos y que cada uno puede ser operacionalizado de una\nmanera en particular. Es más, ellos ya encuentran la posibilidad de la\nalienación como uno de los resultados de las orientaciones negativas\nhacia las instituciones. No está de más recordar cómo es que la\nalienación puede efectivamente cohibir la participación ciudadana en los\nespacios previamente mencionados. Dados los hallazgos previos, es\ncoherente para los objetivos de esta investigación el trabajar\nanalizando las orientaciones hacia el cuarto tipo de objeto político:\nlos outputs y las orientaciones específicas que se buscan analizar es el\naspecto evaluativo. Esto debido a que se acerca más a lo que se busca\nmodelar, como es que la valoración hacia las municipalidades y las\nconsecuencias de su trabajo puede afectar la participación ciudadana en\notras áreas de participación ciudadana. Entonces lo que se quiere medir\ncon esta variable es la percepción de la ciudadanía hacia los outputs\npolíticos de las municipalidades.\nC. Cohesión Vecinal\ni. Definición\nCómo ya fue mencionado en la introducción, la cohesión vecinal es la\nforma en la que se expresa las teorías previas sobre la participación de\nlas personas en organizaciones como las juntas de vecinos. En este caso\nWhite (2012) tiene la contribución más relevante a lo que planteamos\ndebido a la importancia de estructuras previas a las formaciones\nsociales. Si entendemos que las juntas de vecinos son formaciones\nsociales, lo que implicaría que la teoría es que necesitamos de una\nestructura previa para que la formación social pueda emerger. En este\ncaso la cohesión entre los vecinos sería esta estructura previa que es\nindependiente de la formación social, que luego permitiría que las\npersonas quieran organizarse. De esta forma vemos que la cohesión\nvecinal es más bien el mecanismo causal que permite entender la\nimportancia de las formaciones sociales.\nii. Operacionalización\nLa cohesión vecinal no es una variable que se pueda medir de manera\ndirecta, por lo que hay que buscar otras variables que si puedan\nrepresentar a lo que nos referimos cuando lo mencionamos. En este caso,\npara medir la cohesión vecinal vamos a utilizar la confianza en los\nvecinos y la confianza en la vecindad de manera más amplia. Un poco más\nadelante se explica de manera más específica cuales son las variables\nque se utilizan para la creación de un índice de cohesión vecinal.\nAnálisis exploratorio\n\n\n\nPara poder medir las tres variables se utiliza una base de datos\ndesarrollada por RIMISP en base a la Encuesta de Dinámicas Territoriales\ny Bienestar -EDTB- (La base de datos se puede encontrar en el siguiente\nlink: https://dataverse.harvard.edu/dataset.xhtml?persistentId=doi:10.7910/DVN/G9ENDE).\nEsta encuesta se realiza en comunas de cuidades medianas y pequeñas de\ntres países, pero dividen las bases de datos según países, siendo la que\nse utiliza la chilena. Si bien esto tiene algunas debilidades, debido a\nque no es explorable hacia ciudades más grandes, si da la posibilidad de\nexplorar las situaciones de comunas más pequeñas. Estos históricamente\nhan sido desfavorecidos, para dar espacio al estudio de comunas más\ngrandes, en particular las que corresponden a la ciudad de Santiago.\nLa EDTB pregunta una serie de información a vecinos de estas comunas\nsobre el bienestar y características sociodemográficas, pero para esto\nse realiza una serie de filtros para dejar las preguntas más relevantes.\nSe dejan algunas de las preguntas básicas sobre género, nivel\neducacional, nombre de la comuna y otros. Además se deja la pregunta\nl_15h que consulta sobre la participación del vecino en organizaciones\nvecinales, principalmente juntas de vecinos. Además hay preguntas sobre\nlos outputs políticos en la entrega de servicios como la seguridad,\nrecolección de basura, mantenimiento de calles y protección civil\n(1_19a, b, c y d). La tercera y última variable se encuentra en\npreguntas relevantes sobre la confianza que tienen las personas en sus\nvecinos (l_12, l_13, l_14, l_20g, l_25a y m_3e). Otras variables que\ntienen valor teórico como variables de control son si participan en las\nelecciones municipales (l_1 y l_5), interés en asuntos políticos (l_6,\nl_8) y acercamiento a autoridades (l_16b). Primero se hará una\nmodificación de las variables necesarias.\n\n\n\nPara hacer un análisis preliminar y exploratorio se hará un análisis\nde algunas de las preguntas en gráficos descriptivos para hacerse a la\nidea del funcionamiento de la base de datos. Los gráficos se harán en\nbase a las dos primeras variables, pues son las que son medidas de\nmanera más directa en la encuesta que fue aplicada.\nEl primer gráfico para analizar es el de la participación en\norganizaciones vecinales. La pregunta está dispuesta en una respuesta\ndicotómica y vemos que la gran mayoría de personas no participan en\norganizaciones vecinales.\n\n\ndf_jjvv %>% \n  ggplot(aes(x = as.factor(jjvv))) +\n  geom_bar(color = '#000000' , alpha = 0.5)+\n  labs(title = str_wrap(\"Figura 1. Gráfico de barras 'Participación en organización vecinal'(jjvv)\"),\n       subtitle = str_wrap(\"Pregunta: '¿En el último año usted ha participado de manera activa en alguno de los siguientes grupos u organizaciones? Organización vecinal (asociación de vivienda o junta de vecinos)'\", 70),\n       x= \"\", y = \"Frecuencia\") +\n  scale_x_discrete(breaks= c(\"1\", \"0\", NA),\n                   labels = c(\"Si\", \"No\", \"No sabe/No responde\"))+\n  theme_minimal()\n\n\n\nLuego vemos las variables que miden la evaluación de servicios\ncomunales, lo cual puede ser entendido como una orientación evaluativa\nde los outputs políticos a nivel comunal.\n\n\nfrq(df_jjvv, eval_guardia)\n\neval_guardia <categorical> \n# total N=4007 valid N=3136 mean=0.63 sd=0.48\n\nValue |    N | Raw % | Valid % | Cum. %\n---------------------------------------\n    0 | 1156 | 28.85 |   36.86 |  36.86\n    1 | 1980 | 49.41 |   63.14 | 100.00\n <NA> |  871 | 21.74 |    <NA> |   <NA>\n\ndf_jjvv %>% \n  ggplot(aes(x = as.factor(eval_guardia))) +\n  geom_bar(color = '#000000' , alpha = 0.5)+\n  labs(title = str_wrap(\"Figura 2. Gráfico de barras 'Evaluación Servicios Comuna 1'(eval_guardia)\"),\n       subtitle = str_wrap(\"Pregunta: '¿Cómo evaluaría usted la calidad de los siguientes servicios que existen en esta comuna? Seguridad Ciudadana (Guardia Municipal)'\"),\n       x= \"\", y = \"Frecuencia\") +\n  scale_x_discrete(breaks= c(\"0\", \"1\", NA),\n                   labels = c(\"Mala/Muy Mala\", \"Buena/Muy Buena\", \"No responde/No aplica\"))+\n  theme_minimal()\n\n\n\n\n\nfrq(df_jjvv, eval_basura)\n\neval_basura <categorical> \n# total N=4007 valid N=3906 mean=0.83 sd=0.38\n\nValue |    N | Raw % | Valid % | Cum. %\n---------------------------------------\n    0 |  673 | 16.80 |   17.23 |  17.23\n    1 | 3233 | 80.68 |   82.77 | 100.00\n <NA> |  101 |  2.52 |    <NA> |   <NA>\n\ndf_jjvv %>% \n  ggplot(aes(x = as.factor(eval_basura))) +\n  geom_bar(color = '#000000' , alpha = 0.5)+\n  labs(title = str_wrap(\"Figura 3. Gráfico de barras 'Evaluación Servicios Comuna 1'(eval_basura)\"),\n       subtitle = str_wrap(\"Pregunta: '¿Cómo evaluaría usted la calidad de los siguientes servicios que existen en esta comuna? Recolección de basura'\"),\n       x= \"\", y = \"Frecuencia\") +\n  scale_x_discrete(breaks= c(\"0\", \"1\", NA),\n                   labels = c(\"Mala/Muy Mala\",\"Buena/Muy Buena\", \"No responde/No aplica\"))+\n  theme_minimal()\n\n\n\n\n\nfrq(df_jjvv, eval_calles)\n\neval_calles <categorical> \n# total N=4007 valid N=3864 mean=0.62 sd=0.49\n\nValue |    N | Raw % | Valid % | Cum. %\n---------------------------------------\n    0 | 1486 | 37.09 |   38.46 |  38.46\n    1 | 2378 | 59.35 |   61.54 | 100.00\n <NA> |  143 |  3.57 |    <NA> |   <NA>\n\ndf_jjvv %>% \n  ggplot(aes(x = as.factor(eval_calles))) +\n  geom_bar(color = '#000000' , alpha = 0.5)+\n  labs(title = str_wrap(\"Figura 4. Gráfico de barras 'Evaluación Servicios Comuna 1'(eval_calles)\"),\n       subtitle = str_wrap(\"Pregunta: '¿Cómo evaluaría usted la calidad de los siguientes servicios que existen en esta comuna? Mantenimiento de calles y vias'\"),\n       x= \"\", y = \"Frecuencia\") +\n  scale_x_discrete(breaks= c(\"0\", \"1\", NA),\n                   labels = c(\"Mala/Muy Mala\", \"Buena/Muy Buena\", \"No responde/No aplica\"))+\n  theme_minimal()\n\n\n\n\n\nfrq(df_jjvv, eval_proteccion)\n\neval_proteccion <categorical> \n# total N=4007 valid N=2975 mean=0.62 sd=0.49\n\nValue |    N | Raw % | Valid % | Cum. %\n---------------------------------------\n    0 | 1131 | 28.23 |   38.02 |  38.02\n    1 | 1844 | 46.02 |   61.98 | 100.00\n <NA> | 1032 | 25.75 |    <NA> |   <NA>\n\ndf_jjvv %>% \n  ggplot(aes(x = as.factor(eval_proteccion))) +\n  geom_bar(color = '#000000' , alpha = 0.5)+\n  labs(title = str_wrap(\"Figura 5. Gráfico de barras 'Evaluación Servicios Comuna 1'(eval_proteccion)\"),\n       subtitle = str_wrap(\"Pregunta: '¿Cómo evaluaría usted la calidad de los siguientes servicios que existen en esta comuna? Protección civil, por ejemplo, frente a terremotos, inundaciones u otros desastres naturales'\"),\n       x= \"\", y = \"Frecuencia\") +\n  scale_x_discrete(breaks= c(\"0\", \"1\", NA),\n                   labels = c(\"Mala/Muy Mala\", \"Buena/Muy Buena\", \"No responde/No aploca\"))+\n  theme_minimal()\n\n\n\nVemos que en la mayoría de los casos la gente tiende a tener una\nbuena o decente evaluación de los servicios comunales, pero hay una\nmayor varianza en las evaluaciones de Protección civil, Seguridad\nCiudadana y Mantenimiento de calles.\nPara continuar nuestra exploración de la base de datos de la EDTB, se\nrealizarán unas primeras regresiones para analizar de manera preliminar\nlas relaciones entre las variables más esenciales. El tipo de regresión\na utilizar es una de tipo logit, debido a que la variable dependiente es\nuna variable de tipo categórica dummy, es decir, está o no está. En este\ncaso nuestra variable tiene dos posibilidades, participa o no en una\njunta de vecinos. Las columnas utilizamos para describir nuestra\nvariable de outputs políticos son preguntas del 1 al 4 en términos de\npercepción de la entrega de estos servicios de parte de la población.\nEstas variables fueron recodificadas para que fuesen binarias, es decir,\nque tomen un valor de un 0 o un 1, “1” significa que tienen una\nevaluación buena o muy buena de los servicios. Inicialmente se correrán\ncinco regresiones, una con cada una de las variables y una final con las\ncuatro juntas. Ninguna otra variable quedará en este análisis\ninicial.\nPrimeros Modelos\n\n\nmodelo_1 <- glm(jjvv ~ eval_guardia, \n                data = df_jjvv,\n                family = binomial(\"logit\"))\n\nmodelo_2 <- glm(jjvv ~ eval_basura, \n                data = df_jjvv,\n                family = binomial(\"logit\"))\n\nmodelo_3 <- glm(jjvv ~ eval_calles, \n                data = df_jjvv,\n                family = binomial(\"logit\"))\n                \nmodelo_4 <- glm(jjvv ~ eval_proteccion, \n                data = df_jjvv,\n                family = binomial(\"logit\"))\n\nmodelo_5 <- glm(jjvv ~ eval_guardia + eval_basura + eval_calles + eval_proteccion, \n                data = df_jjvv,\n                family = binomial(\"logit\"))\n\nmodelos <- list(modelo_1, modelo_2, modelo_3, modelo_4, modelo_5)\n\n\n\n\n======================================================================================\n                  Model 1       Model 2       Model 3       Model 4       Model 5     \n--------------------------------------------------------------------------------------\n(Intercept)          -1.18 ***     -1.16 ***     -1.08 ***     -1.08 ***     -1.12 ***\n                     (0.07)        (0.09)        (0.06)        (0.07)        (0.13)   \neval_guardia1        -0.22 *                                                 -0.05    \n                     (0.09)                                                  (0.11)   \neval_basura1                       -0.14                                      0.12    \n                                   (0.10)                                    (0.14)   \neval_calles1                                     -0.29 ***                   -0.18    \n                                                 (0.08)                      (0.12)   \neval_proteccion1                                               -0.28 **      -0.23 *  \n                                                               (0.09)        (0.11)   \n--------------------------------------------------------------------------------------\nAIC                3199.91       4047.72       4014.19       3110.78       2633.48    \nBIC                3211.98       4060.23       4026.68       3122.75       2662.70    \nLog Likelihood    -1597.95      -2021.86      -2005.09      -1553.39      -1311.74    \nDeviance           3195.91       4043.72       4010.19       3106.78       2623.48    \nNum. obs.          3099          3852          3803          2935          2550       \n======================================================================================\n*** p < 0.001; ** p < 0.01; * p < 0.05\n\nCómo podemos apreciar, todas las variables tienen significancia\nestadística, exceptuando la variable que mide la percepción del servicio\nde Recolección de Basura. Cuando medimos las cinco variables juntas\nvemos que la única que tiene significancia estadística es la percepción\ndel servicio de Protección Civil en casos de emergencia, esto se puede\ndeber a que las cuatro variables estén altamente correlacionadas, lo que\nnos indica que el mejor camino a tomar es formar un índice con las\ncuatro preguntas. En términos de direccionalidad vemos que cuando sube\nla evaluación de los servicios municipales, baja la probabilidad de que\nel individuo participe en las juntas de vecinos. Esto mismo vemos cuando\nanalizamos los Odds de las regresiones:\n\n  (Intercept) eval_guardia1 \n    0.3084005     0.8018735 \n (Intercept) eval_basura1 \n   0.3127490    0.8733073 \n (Intercept) eval_calles1 \n   0.3391705    0.7469203 \n     (Intercept) eval_proteccion1 \n       0.3401937        0.7561029 \n\nPor ejemplo, cuando una persona tiene una evaluación positiva de la\nguardia municipal, la probabilidad de que participe en una junta de\nvecinos es de 0.8, lo que en términos de probabilidad, significa que\ndisminuye. Este patrón se ve en todas las variables, aunque entre las\nque son significativas (todas menos Recolección de Basura), la que tiene\nun Odd más grande es la evaluación de la Guardia Municipal. En términos\nde comportamiento esto nos indica que las personas tienden a participar\nmás en las juntas de vecinos cuando las evaluaciones de los servicios\npúblicos de la comuna son negativos.\nModelo a utilizar\nEsto nos lleva a plantear nuestro modelo que luego va a ser utilizado\nen el resto del trabajo:\n\\[Participación\\ Juntas\\ de\\ Vecinos =\n\\alpha + \\ Evaluación\\ Servicios\\ X_1+   Cohesión\\ vecinal\\ X_2 + \\\\\nParticipación\\ Elecciónes\\ X_3+ Interés\\ en\\ asuntos\\ políticos\\ X_4\n+  Género\\ X_5 + \\\\  Edad\\ X_6+ Estado\\ laboral\\ X_7 + Comuna\\ rural\\\nX_8 + \\mu  \\]\nLas variables de Evaluación de Servicios, Cohesión Vecinal e Interés\nen asuntos políticos serán índices. Evaluación de Servicios implican las\nvariables ya evaluadas, Cohesión Vecinal incluye preguntas respecto a la\ncantidad de números de teléfonos de vecinos que tiene el individuo\n(n_telefono, n_otorgado), si les pide ayuda a vecinos en casos de\nnecesidad y opiniones sobre la ayuda (ayuda_de_vecino, opinion_ayuda),\nel nivel de confianza en los vecinos (confianza_vecinos) y la\nsatisfacción que tienen con su barrio de manera más general\n(satisfacción_barrio).\nLas variables de control serán Participación electoral, Interés en\nAsuntos Políticos y variables sociodemográficas. Participación electoral\nse mide cuando se pregunta si es que participó de elecciones municipales\ny las sociodemográficas tienen que ver con género, edad, estado laboral\ny si la comuna es rural. Interés en Asuntos Políticos se medirá con la\nvariable ‘interés_politico’, que pregunta directamente esto. Se sumarán\nademás otras variables sobre participación en organizaciones políticas\n(org_politica, sindicato, campaña), opinión sobre la democracia\n(opinion_democracia) y comportamiento del voto de manera más amplia\n(voto_comp). Se separa el voto y el comportamiento general del voto,\npues se entiende que hay una diferencia entre el voto en una ocasión\nparticular y el voto como un hábito, que muestra el interés en la\npolítica de manera más general que puntual.\nParticipación en elecciones es utilizado como una variable de control\nse entiende que el voto es una forma primera de participación, previa al\ninvolucramiento en organizaciones (Lijphart, 1997). Además, se ve que la\nmayoría de las personas que participan en las movilizaciones en 2019 si\neran personas que votaban (Leibe, Palanza y Sánchez, 2021), por lo que\nse puede esperar que sea similar en el caso de la participación\nciudadana. El Interés en la Política se ve como esencial para la\nparticipación en elecciones (Blais, Young y Lapp, 2000), por lo que es\ninteresante ver cómo afecta en otras formas de participación.\nHipótesis\nTeniendo en cuenta la exploración previa y la teoría veríamos que la\ndireccionalidad de la Evaluación de Servicios y la Cohesión Vecinal es\nbastante clara. Mientras la mejor sea la Evaluación de Servicios del\nmunicipio, menor la participación en juntas de vecinos. Mientras mayor\nsea la Cohesión Vecinal, mayor debiese ser la participación en juntas de\nvecinos. Queda ahora la pregunta de ¿Cuál es más importante? En este\nsentido (y sumado a las hipótesis nulas de rigor) tendríamos dos\nhipótesis.\nHipótesis 1\nLa probabilidad de participar en la junta de vecinos está más\ninfluenciada por la Evaluación de Servicios Municipales que por la\nCohesión Vecinal.\nHipótesis 2\nLa probabilidad de participar en la junta de vecinos está menos\ninfluenciada por la Evaluación de Servicios Municipales que por la\nCohesión Vecinal.\nCreación de Índices\nÍndice de Evaluación de\nServicios\nDebido a los resultados exploratorios y la sospecha de alta\ncorrelación entre las variables de Evaluación de Servicios Municipales,\nse analiza la posibilidad de generar un índice con las variables, por lo\nque se utiliza la técnica PCA. Lo primero que debemos hacer es un\nanálisis de correlación entre las cuatro variables.\n\n\n\n\n                 eval_guardia1 eval_basura1 eval_calles1\neval_guardia1        1.0000000    0.2246098    0.3350290\neval_basura1         0.2246098    1.0000000    0.3672793\neval_calles1         0.3350290    0.3672793    1.0000000\neval_proteccion1     0.3836664    0.2953453    0.4136563\n                 eval_proteccion1\neval_guardia1           0.3836664\neval_basura1            0.2953453\neval_calles1            0.4136563\neval_proteccion1        1.0000000\n\n\nVemos que las cuatro variables tienen una buena correlación, aunque\nno sea demasiado alta, lo cual era sospechado previamente en los\nanálisis exploratorios y las primeras regresiones. Luego procedemos a\ngenerar un PCA, además de analizar los eigenvalues y generar el Scree\nplot para decidir cuáles serán los pesos de las dimensiones que se\nincluyan en el índice final.\n\n      eigenvalue variance.percent cumulative.variance.percent\nDim.1  1.8631631         46.57908                    46.57908\nDim.2  0.8481190         21.20298                    67.78205\nDim.3  0.6832307         17.08077                    84.86282\nDim.4  0.6054871         15.13718                   100.00000\n\n\n\n\nEn el Scree plot vemos que solamente la primera variable pasa el\nlímite deseable de 1, pero cuando analizamos los eigenvalues y el aporte\nque hacen a la varianza de la muestra, esto no es suficiente para la\ncreación del índice por sí solo. Para analizar de manera más profunda\ncuáles son las dimensiones para utilizar para crear el índice, se\nanalizarán las contribuciones de las variables a cada una de las\ndimensiones.\n\n\n\nDado que las cuatro variables responden a la Evaluacion de Servicios\nmunicipales, no hay grandes diferencias teóricas respecto de las\ndiferentes dimensiones, por lo que se eligen respecto a la\nrepresentación de variables en las dimensiones. Gracias a estos gráficos\nvemos que si incluimos las tres primeras dimensiones tenemos una\nrepresentación de las cuatro preguntas, aunque vemos que la que menos\naporta es la de Protección Civil. Esto tiene sentido, pues es una\npregunta que refiere a casos extremos o emergencias, por lo que es\ncomprensible que muchas personas no les interese, además es la variable\ncon más NA. De esta manera se eligen las tres primeras dimensiones,\nporque a pesar de que las Dimensiones 2 y 3 no superan el límite en el\nScree Plot, si aportan a la varianza explicada y a la representación de\nlas cuatro variables en el índice. A continuación se forma el\níndice:\n\n\nindice_evaluacion <- pca_evaluacion$ind$coord %>% \n  as_tibble() %>% \n  mutate(evaluacion_serv = (Dim.1 * 46.57908 + Dim.2 * 21.20298 + Dim.4 *17.08077)/84.86282)\n\ndf_jjvv <- df_jjvv %>% \n  bind_cols(indice_evaluacion %>% select(evaluacion_serv))\n\nrescale01 <- function(x) {\n  rng <- range(x, na.rm = TRUE)\n  (x - rng[1]) / (rng[2] - rng[1])\n}\n\ndf_jjvv <- df_jjvv %>%\n  mutate(evaluacion_serv = rescale01(evaluacion_serv))\n\n\nÍndice de Cohesión Vecinal\nEl proceso de creación de índice de Cohesión Vecinal es muy similar\nal de Evaluación de Servicios Municipales, aunque es por otras razones.\nLa Cohesión Vecinal es una variable latente, pero no observable, por lo\nque utilizamos variables observables en conjunción como un proxy para el\nanálisis de la variable que nos interesa. En este caso utilizamos las\nvariables que se mencionaron cuando se definió el Modelo a utilizar. A\ncontinuación analizamos la correlación entre las siete variables.\n\n\n\n\n                    n_telefono n_otorgado dinero_prestado\nn_telefono          1.00000000 0.88820690      0.17638662\nn_otorgado          0.88820690 1.00000000      0.16511922\ndinero_prestado     0.17638662 0.16511922      1.00000000\nayuda_de_vecino     0.17584210 0.18190099      0.07426899\nconfianza_vecinos   0.17833443 0.16727249      0.12322545\nopinion_ayuda       0.05364280 0.05375590      0.07700295\nsatisfaccion_barrio 0.08652419 0.08243431      0.04191447\n                    ayuda_de_vecino confianza_vecinos opinion_ayuda\nn_telefono              0.175842103       0.178334432  0.0536427998\nn_otorgado              0.181900987       0.167272485  0.0537559013\ndinero_prestado         0.074268987       0.123225450  0.0770029463\nayuda_de_vecino         1.000000000       0.089437797  0.0252066755\nconfianza_vecinos       0.089437797       1.000000000 -0.0037659467\nopinion_ayuda           0.025206675      -0.003765947  1.0000000000\nsatisfaccion_barrio     0.003255339       0.302254957  0.0004817192\n                    satisfaccion_barrio\nn_telefono                 0.0865241876\nn_otorgado                 0.0824343134\ndinero_prestado            0.0419144686\nayuda_de_vecino            0.0032553386\nconfianza_vecinos          0.3022549569\nopinion_ayuda              0.0004817192\nsatisfaccion_barrio        1.0000000000\n\n\nVemos que lamentablemente las cuatro variables no tienen muy buena\ncorrelación entre sí, a excepción de las variables de número de\nteléfono. Esto es porque tiene sentido lógico, pues tener los teléfonos\nde tus vecinos no es una relación unidireccional, sino que cuando te dan\nel número de tu vecino, en general das tu número para que el contacto\nsea bilateral. Si bien la situación respecto de la correlación no es\nideal desde un punto de vista teórico, se continua con el proceso de\ngenerar un PCA y su Scree Plot.\n\n      eigenvalue variance.percent cumulative.variance.percent\nDim.1  2.1232360        30.331942                    30.33194\nDim.2  1.2064438        17.234912                    47.56685\nDim.3  1.0208149        14.583070                    62.14992\nDim.4  0.9335181        13.335973                    75.48590\nDim.5  0.9069322        12.956175                    88.44207\nDim.6  0.6960655         9.943793                    98.38586\nDim.7  0.1129895         1.614136                   100.00000\n\n\n\n\nUn análisis entre el Scree Plot y los eigenvalues del PCA nos indica\nque lo mejor es utilizar las tres primeras dimensiones, pues pasan el\numbral que vemos en el Scree Plot y logran reprsentar una buena cantidad\nde la varianza de la muestra.\n\n\n\nCuando vemos las dimensiones podemos ver las dimensiones teóricas de\nmanera clara: - La Dimensión 1 presenta esta idea clara de la\ncomunicación con tus vecinos, representada por los números de teléfonos\nintercambiados. - La Dimensión 2 se puede ver como la confianza con la\ncomunidad, sea con el barrio de manera abstracta o con los vecinos de\nmanera más concreta. - La Dimensión 3 vemos la importancia de la ayuda\nmutua dentro de la comunidad como una muestra de la cohesión con los\nvecinos.\nA partir de esto generamos un índice:\n\n       Dim.1       Dim.2      Dim.3       Dim.4      Dim.5\n1 -0.8736164  0.05372258  1.1390261 -0.15326220  0.2283102\n2  0.8367040 -0.77085736  1.6126805 -0.74239468 -0.8963016\n3 -1.0185529 -0.27478406  1.5729141 -0.42857975 -0.1966695\n4  0.1200686 -2.59091378 -0.2040291  0.22390055 -1.7604759\n5  1.0198335  1.12437480 -0.7375057 -0.41360856 -0.1967383\n6  0.9426278 -1.44200892  1.6775492 -0.02825462 -1.5310394\n\n\n\nindice_cohesion <- pca_cohesion$ind$coord %>% \n  as_tibble() %>% \n  mutate(indice_cohesion_vecinal = (Dim.1 * 30.331942 + Dim.2 * 17.234912 + Dim.3 *14.583070)/62.14992)\n\ndf_jjvv <- df_jjvv %>% \n  bind_cols(indice_cohesion %>%  select(indice_cohesion_vecinal))\n\nrescale01 <- function(x) {\n  rng <- range(x, na.rm = TRUE)\n  (x - rng[1]) / (rng[2] - rng[1])\n}\n\ndf_jjvv <- df_jjvv %>%\n  mutate(indice_cohesion_vecinal = rescale01(indice_cohesion_vecinal))\n\n\nAnálisis de\nCluster del Índice de Cohesión Vecinal\nDebido a que la Cohesión Vecinal fue la única variable que no fue\nposible analizar en los análisis preliminares, se hará un análisis de\nClusters para poder entender mejor la muestra que obtenemos. Debido a la\ncantidad de variables no podemos hacer un análisis de distancia, así que\npasamos directamente al análisis de Clusters con un Cluster plot. Se\nprueba hace un plot con dos Clusters y el resultado es el siguiente:\n\n\ndf_clusters <- na.omit(indice_cohesion)\ndf_clusters <- scale(indice_cohesion)\n\nclusters1 <- kmeans(df_clusters, centers = 2, nstart = 25)\nfviz_cluster(clusters1, df_clusters)\n\n\n\nDe manera visual podemos asumir que se forman dos clusters, uno en la\nparte superior y otra en la parte inferior. Sin embargo, cuando de\nmanera matemática vemos los dos clusters separados por la sección\nderecha e izquierda, lo cual no corresponde con la intuición visual, por\nlo que se prueba con tres Clusters en el siguiente gráfico:\n\n\n\nVemos que se forman tres clusters de una manera un poco más\nintuitiva, pues el Cluster en la parte superior es más claro, aunque la\nseparación entre los Clusters 1 y 3 son bastante poco distintivos. A\npartir de esto se prueba hacer 4 Clusters:\n\n\n\nVemos que el segundo Cluster visual es separado en tres y las\ndistancias entre los Clusters 2, 3 y 4 es imposible de analizar. De esta\nmanera se comprende que vemos una diferencia muy fuerte entre quienes\nconfían en su comunidad (Dim.2) y quienes contactan a su comunidad\n(Dim.1). Si bien desde un punto de vista intuitivo esto tiene sentido,\ndesde un punto de vista Matemático R no logra hacer esta diferenciación\nde manera directa.\nÍndice de Interés Político\nEl último índice para realizar es el que fue mencionado como una\nvariable de control, el Índice de Interés Político, para el cual\nutilizamos las variables que mencionamos previamente cuando se presenta\nel modelo. El primer paso para el PCA es como siempre el análisis de\ncorrelación de las seis variables.\n\n\n\n\n                    voto_comp1 interes_politico1   campaña1\nvoto_comp1          1.00000000        0.31728745 0.14915766\ninteres_politico1   0.31728745        1.00000000 0.36497876\ncampaña1            0.14915766        0.36497876 1.00000000\norg_politica1       0.08913216        0.20182175 0.17752303\nsindicato1          0.01993304        0.05913244 0.03058523\nopinion_democracia1 0.06306662        0.10087202 0.07106377\n                    org_politica1  sindicato1 opinion_democracia1\nvoto_comp1            0.089132158 0.019933038          0.06306662\ninteres_politico1     0.201821749 0.059132442          0.10087202\ncampaña1              0.177523026 0.030585229          0.07106377\norg_politica1         1.000000000 0.008634996          0.01720945\nsindicato1            0.008634996 1.000000000          0.03812566\nopinion_democracia1   0.017209454 0.038125663          1.00000000\n\n\nVemos nuevamente que las correlaciones no son tan fuertes como se\nesperaría para un PCA, pero se continúa con el proceso para analizar los\neigenvalues y el Scree Plot.\n\n      eigenvalue variance.percent cumulative.variance.percent\nDim.1  1.6890436         28.15073                    28.15073\nDim.2  1.0217910         17.02985                    45.18058\nDim.3  0.9635140         16.05857                    61.23914\nDim.4  0.9163101         15.27184                    76.51098\nDim.5  0.8248915         13.74819                    90.25917\nDim.6  0.5844498          9.74083                   100.00000\n\n\n\n\nA partir de esto vemos que las primeras tres dimensiones superan el\numbral para entrar dentro de un índice y estas representan un buen\nporcentaje de la varianza de la muestra, por lo que pasamos a ver las\ndimensiones.\n\n\n\nVemos que la primera dimensión se ve representada por la pregunta\ndirecta sobre interés político, por lo que puede ser definida como esto.\nLa segunda y la tercera dimensión no tienen mucha diferencia respecto de\nlas variables que contribuyen y ambas pueden ser catalogadas como\ndemocratización fuera de las elecciones, sobre todo cuando consideramos\nla sindicalización como una fuente de democratización, según Pateman\n(1970). Sin embargo, esta indistinción entre las dos dimensiones lleva a\ncuestionar la presencia de ambas en el índice, por lo que se analiza la\ncuarta dimensión, que si bien no pasa el umbral en el Scree Plot, si\nestá bastante cerca y aporta a la varianza un porcentaje muy similar a\nla dimensión 3. La dimensión 4 es el comportamiento político de manera\nmás concreta, es decir, la participación en organizaciones políticas y\nel votar de manera habitual. De esta manera, se decide utilizar la\ndimensión 4 y no la tercera dentro de la formación del índice a\ncontinuación:\n\n       Dim.1      Dim.2      Dim.3      Dim.4       Dim.5\n1  0.4741961  0.4897557 -0.7873625  0.2459174  0.23919599\n2 -1.1762846  0.5964792 -0.6686209  1.0451893 -0.06227916\n3 -1.6097133  0.6316335 -0.5134091  1.6483636 -0.48386172\n4 -1.8969740 -0.2816605  0.5335900  1.0661420 -0.63903754\n5  1.4361324  0.4881775 -0.9844520 -0.5981912  0.48081425\n6  0.4208505  0.5359962 -0.8274377  0.1506604  0.15925559\n\n\n\nindice_interes <- pca_interes$ind$coord %>% \n  as_tibble() %>% \n  mutate(indice_interes_pol = (Dim.1 * 28.15073 + Dim.2 * 17.02985 + Dim.4 *15.27184)/60.54242)\n\ndf_jjvv <- df_jjvv %>% \n  bind_cols(indice_interes %>%  select(indice_interes_pol))\n\nrescale01 <- function(x) {\n  rng <- range(x, na.rm = TRUE)\n  (x - rng[1]) / (rng[2] - rng[1])\n}\n\ndf_jjvv <- df_jjvv %>%\n  mutate(indice_interes_pol = rescale01(indice_interes_pol))\n\n\nModelos y Resultados Finales\nUtilizando los índices previamente creados y las variables de\ncontrol, creamos la siguiente regresión logística y a partir de esto\nvemos además los resultados de esta.\n\n\nmodelo_6 <- glm(jjvv ~ evaluacion_serv + indice_interes_pol + indice_cohesion_vecinal + voto + mujer + edad + trabajo + rural, \n                data = df_jjvv,\n                family = binomial(\"logit\"))\n\nscreenreg(modelo_6)\n\n\n=====================================\n                         Model 1     \n-------------------------------------\n(Intercept)                 -3.92 ***\n                            (0.22)   \nevaluacion_serv             -0.60 ***\n                            (0.14)   \nindice_interes_pol           1.66 ***\n                            (0.37)   \nindice_cohesion_vecinal      3.56 ***\n                            (0.30)   \nvoto1                        0.35 ***\n                            (0.09)   \nmujer1                       0.34 ***\n                            (0.09)   \nedad                         0.00    \n                            (0.00)   \ntrabajo1                     0.14    \n                            (0.09)   \nrural1                       0.67 ***\n                            (0.08)   \n-------------------------------------\nAIC                       3811.08    \nBIC                       3867.53    \nLog Likelihood           -1896.54    \nDeviance                  3793.08    \nNum. obs.                 3915       \n=====================================\n*** p < 0.001; ** p < 0.01; * p < 0.05\n\nVemos que las direccionalidades de las variables responden a lo que\npreviamente se planteó: la direccionalidad de la Evaluación de Servicios\nes negativa y la de Cohesión Vecinal es positiva. Vemos además que todas\nlas variables exceptuando edad y estado laboral son significativas, por\nlo que se forma un nuevo modelo que no tome en cuenta estas dos\nvariables.\n\n\nmodelo_7 <- glm(jjvv ~ evaluacion_serv + indice_interes_pol + indice_cohesion_vecinal + voto + mujer + rural, \n                data = df_jjvv,\n                family = binomial(\"logit\"))\n\nmodelos_2 <- list(modelo_6, modelo_7)\n\nscreenreg(modelos_2)\n\n\n===================================================\n                         Model 1       Model 2     \n---------------------------------------------------\n(Intercept)                 -3.92 ***     -3.68 ***\n                            (0.22)        (0.20)   \nevaluacion_serv             -0.60 ***     -0.60 ***\n                            (0.14)        (0.14)   \nindice_interes_pol           1.66 ***      1.69 ***\n                            (0.37)        (0.37)   \nindice_cohesion_vecinal      3.56 ***      3.55 ***\n                            (0.30)        (0.30)   \nvoto1                        0.35 ***      0.36 ***\n                            (0.09)        (0.09)   \nmujer1                       0.34 ***      0.30 ***\n                            (0.09)        (0.09)   \nedad                         0.00                  \n                            (0.00)                 \ntrabajo1                     0.14                  \n                            (0.09)                 \nrural1                       0.67 ***      0.67 ***\n                            (0.08)        (0.08)   \n---------------------------------------------------\nAIC                       3811.08       3812.43    \nBIC                       3867.53       3856.34    \nLog Likelihood           -1896.54      -1899.22    \nDeviance                  3793.08       3798.43    \nNum. obs.                 3915          3915       \n===================================================\n*** p < 0.001; ** p < 0.01; * p < 0.05\n\nCuando hacemos una comparación entre ambos modelos no hay mucho\ncambio cuando sacamos las variables y en general los coeficientes son\nbastante similares en ambos modelos, por lo que se analizan los Odds\nluego.\n\n            (Intercept)         evaluacion_serv \n              0.0252501               0.5471407 \n     indice_interes_pol indice_cohesion_vecinal \n              5.3929473              34.7868501 \n                  voto1                  mujer1 \n              1.4352809               1.3523990 \n                 rural1 \n              1.9607532 \n\nLos Odds que más nos interesan son los de nuestras variables de\nanálisis: Evaluación de Servicios y Cohesión Vecinal. Vemos que un\ncambio positivo de Evaluación de Servicios genera que las posibilidades\nde participar en una junta de vecinos se multipliquen por 0.54, lo que\nes más o menos sea la mitad que una Evaluación de Servicios negativa.\nSin embargo, la Cohesión Vecinal es mucho más significativa a un nivel\nsustancial, pues un cambio positivo de la Cohesión Vecinal significa que\nla posibilidad de participar en una junta de vecinos es alrededor de 35\nveces mayor.\nConclusiones\nDada la forma en la que fueron planteadas las hipótesis, era\nnecesario que una fallase para que la otra tuviese sentido y lo que se\npuede ver a partir de las regresiones que se analizan es que la\nhipótesis 2 es la que más representa la realidad. Esto tiene sentido,\nporque la hipótesis 2 era la que más sustento teórico tiene, la cohesión\nvecinal es mucho más influyente en tomar la decisión de participar en\nuna junta de vecinos que la evaluación del trabajo de una municipalidad.\nLo anterior no significa que la evaluación de servicios sea algo que no\ninfluya en la decisión, pero parece ser que las motivaciones para\nparticipar en una junta de vecinos van mucho más allá de la indignación\nde sobre las acciones de la municipalidad. Participar en una junta de\nvecinos parece responder al sentimiento de comunidad, de participar y\ntrabajar en pos de la comunidad y parece ser que la idea que motiva a la\nparticipación es la empatía más que algo meramente reactivo al accionar\nde un agente externo.\nEl trabajo presenta varias limitaciones, entre ellas la base de datos\ny la calidad de las respuestas. Particularmente en los índices vemos una\nfalta de correlación que hace que la aplicación de un PCA pueda ser\nvisto con malos ojos, similar a la forma en la que funciona el análisis\nde cluster. Sin embargo, este trabajo igualmente presenta un posible\ncamino de investigación posterior, particularmente las motivaciones de\nla participación y esto nos puede llevar a fortalecer las juntas de\nvecinos como lugares de formación política.\nReferencias Bibliográficas\nAlmond, G. A., & Verba, S. (1963). The civic culture: Political\nattitudes and democracy in five nations. Princeton University Press.\nBlais, A., Young, R., & Lapp, M. (2000). The calculus of voting:\nAn empirical test. European Journal of Political Research, 37(2),\n181-201.\nCáceres J., G. (1983). Algunos antecedentes sobre la génesis de las\njuntas de vecinos en Chile. Revista de trabajo social [artículo de\nrevista].\nCantillan, Roberto, & Herrera, José. (2020). Centralidad de\nactores y bloques en las redes organizativas de movilización en el\nconflicto por el Plan Regulador Comunal de Peñalolén el año 2011. EURE,\n46(138), 25-46.\nDe la Fuente, G. (2013) Mitos y realidades de la participación\nciudadana en Chile. En De la Fuente, G. & Mlynarz, D. (Eds.) El\npueblo unido: mitos y realidades de la participación ciudaana en Chile.\n(pp. 15-38). Ediciones Universidad Alberto Hurtado.\nEagly, A. & Chaiken S. (1998) Attitude Structure and Function. En\nGilbert, D., S. Fiske & G. Lindzey (Eds.), The Handbook of Social\nPsychology (pp. 269-310). McGraw Hill.\nMarcus, G. E. (2013). Political psychology: Neuroscience, genetics,\nand politics. Oxford University Press.\nLeibe, L. M., Palanza, V., & Staniak, F. S. (2022). ¿ Voto versus\nProtesta? La movilización como mecanismo de participación ciudadana.\nPolis. Revista Latinoamericana, (61).\nLijphart, A. (1997). Unequal participation: Democracy’s unresolved\ndilemma presidential address, American Political Science Association,\n1996. American political science review, 91(1), 1-14.\nPateman, Carole (1970). Participation and Democratic Theory.\nCambridge: Cambridge University Press.\nSmith, G. (2009). Democratic innovations: Designing institutions for\ncitizen participation. Cambridge University Press.\nTilly, C. (2000). La desigualdad persistente. Buenos Aires:\nManantial.\nTilly, C. (2010). Democracia. Madrid: Akal.\nWhite, H. (2012). Identity and Control : How Social Formations Emerge\n- Second Edition (Second. ed.).\n\n\n\n",
    "preview": "posts/2022-11-30-entrega-final/entrega-final_files/figure-html5/unnamed-chunk-3-1.png",
    "last_modified": "2022-12-04T21:16:30-03:00",
    "input_file": "entrega-final.knit.md"
  },
  {
    "path": "posts/2022-10-03-entrega-3-grficos-y-tablas/",
    "title": "Entrega 3: gráficos y tablas",
    "description": "Tercera entrega para el trabajo de ICP5006",
    "author": [
      {
        "name": "Felipe Garrido",
        "url": "https://fgarrido-m.github.io/"
      }
    ],
    "date": "2022-10-03",
    "categories": [
      "Trabajo"
    ],
    "contents": "\n\n\n\nPara poder medir las dos primeras variables, se utiliza una base de\ndatos desarrollada por RIMISP en base a la Encuesta de Dinámicas\nTerritoriales y Bienestar -EDTB- (La base de datos se puede encontrar en\nel siguiente link: https://dataverse.harvard.edu/dataset.xhtml?persistentId=doi:10.7910/DVN/G9ENDE).\nEsta encuesta se realiza en comunas de cuidades medianas y pequeñas de\ntres países, pero dividen las bases de datos según países, siendo la que\nse utiliza la chilena. Si bien esto tiene algunas debilidades, debido a\nque no es explorable hacia ciudades más grandes, si da la posibilidad de\nexplorar las situaciones de comunas más pequeñas. Estos históricamente\nhan sido desfavorecidas, para dar espacio al estudio de comunas más\ngrandes, en particular las que corresponden a la ciudad de Santiago.\nLa EDTB pregunta una serie de información a vecinos de estas comunas\nsobre el bienestar y características sociodemográficas, pero para esto\nrealizamos una serie de filtros para dejar las preguntas más relevantes.\nSe dejan algunas de las preguntas básicas sobre género, nivel\neducacional, nombre de la comuna y otros. Además se deja la pregunta\nl_15h que consulta sobre la participación del vecino en organzaciones\nvecinales, principalmente juntas de vecinos. Además hay preguntas sobre\nlos outputs políticos en la entrega de servicios como la seguridad,\nrecolección de basura, mantenimiento de calles y protección civil\n(1_19a, b, c y d). Esto nos deja con las variables que más se requieren\npara esta investigación. Otras variables que podrían ser interesantes en\nel futuro son si participan en las elecciones municipales (l_1 y l_5),\ninterés en asuntos políticos (l_6, l_8), medición de cohesión vecinal\n(l_12,l_16a, l_20g), acercamiento a autoridades (l_16b) y satisfacción\ncon la comunidad y sus autoridades (m_3d, e y f). Primero se hará una\nmodificación de las variables necesarias.\n\n1 variables were not found in the dataset: L_6\n\nEl primer gráfico a analizar es el de la participación en\norganizaciones vecinales. La pregunta está dispuesta en una respuesta\ndicotómica y vemos que la gran mayoría de personas no participan en\norganizaciones vecinales.\n\n\ndf_part_mod %>% \n  ggplot(aes(x = as.factor(j_vecinos))) +\n  geom_bar(color = '#000000' , alpha = 0.5)+\n  labs(title = \"Figura 1. Gráfico de barras 'Participación en organización vecinal'(j_vecinos)\",\n       subtitle = str_wrap(\"Pregunta: '¿En el último año usted ha participado de manera activa en alguno de los siguientes grupos u organizaciones? Organización vecinal (asociación de vivienda o junta de vecinos)'\", 70),\n       x= \"\", y = \"Frecuencia\") +\n  scale_x_discrete(breaks= c(\"1\", \"0\", NA),\n                   labels = c(\"Si\", \"No\", \"No sabe/No responde\"))+\n  theme_minimal()\n\n\n\nLuego vemos las variables que miden la evaluación de servicios\ncomunales, lo cual puede ser entendido como una evaluación de los\noutputs políticos definidos en la segunda entrega.\n\n\nfrq(df_part_mod, guardia_muni)\n\nguardia_muni <categorical> \n# total N=4007 valid N=3136 mean=0.63 sd=0.48\n\nValue |    N | Raw % | Valid % | Cum. %\n---------------------------------------\n    0 | 1156 | 28.85 |   36.86 |  36.86\n    1 | 1980 | 49.41 |   63.14 | 100.00\n <NA> |  871 | 21.74 |    <NA> |   <NA>\n\ndf_part_mod %>% \n  ggplot(aes(x = as.factor(guardia_muni))) +\n  geom_bar(color = '#000000' , alpha = 0.5)+\n  labs(title = \"Figura 2. Gráfico de barras 'Evaluación Servicios Comuna 1'(guardia_muni)\",\n       subtitle = str_wrap(\"Pregunta: '¿Cómo evaluaría usted la calidad de los siguientes servicios que existen en esta comuna? Seguridad Ciudadana (Guardia Municipal)'\"),\n       x= \"\", y = \"Frecuencia\") +\n  scale_x_discrete(breaks= c(\"0\", \"1\", NA),\n                   labels = c(\"Mala/Muy Mala\", \"Buena/Muy Buena\", \"No responde/No aplica\"))+\n  theme_minimal()\n\n\n\n\n\nfrq(df_part_mod, rec_basura)\n\nrec_basura <categorical> \n# total N=4007 valid N=3906 mean=0.83 sd=0.38\n\nValue |    N | Raw % | Valid % | Cum. %\n---------------------------------------\n    0 |  673 | 16.80 |   17.23 |  17.23\n    1 | 3233 | 80.68 |   82.77 | 100.00\n <NA> |  101 |  2.52 |    <NA> |   <NA>\n\ndf_part_mod %>% \n  ggplot(aes(x = as.factor(rec_basura))) +\n  geom_bar(color = '#000000' , alpha = 0.5)+\n  labs(title = \"Figura 3. Gráfico de barras 'Evaluación Servicios Comuna 1'(rec_basura)\",\n       subtitle = str_wrap(\"Pregunta: '¿Cómo evaluaría usted la calidad de los siguientes servicios que existen en esta comuna? Recolección de basura'\"),\n       x= \"\", y = \"Frecuencia\") +\n  scale_x_discrete(breaks= c(\"0\", \"1\", NA),\n                   labels = c(\"Mala/Muy Mala\",\"Buena/Muy Buena\", \"No responde/No aplica\"))+\n  theme_minimal()\n\n\n\n\n\nfrq(df_part_mod, mant_calles)\n\nmant_calles <categorical> \n# total N=4007 valid N=3864 mean=0.62 sd=0.49\n\nValue |    N | Raw % | Valid % | Cum. %\n---------------------------------------\n    0 | 1486 | 37.09 |   38.46 |  38.46\n    1 | 2378 | 59.35 |   61.54 | 100.00\n <NA> |  143 |  3.57 |    <NA> |   <NA>\n\ndf_part_mod %>% \n  ggplot(aes(x = as.factor(mant_calles))) +\n  geom_bar(color = '#000000' , alpha = 0.5)+\n  labs(title = \"Figura 4. Gráfico de barras 'Evaluación Servicios Comuna 1'(mant_calles)\",\n       subtitle = str_wrap(\"Pregunta: '¿Cómo evaluaría usted la calidad de los siguientes servicios que existen en esta comuna? Mantenimiento de calles y vias'\"),\n       x= \"\", y = \"Frecuencia\") +\n  scale_x_discrete(breaks= c(\"0\", \"1\", NA),\n                   labels = c(\"Mala/Muy Mala\", \"Buena/Muy Buena\", \"No responde/No aplica\"))+\n  theme_minimal()\n\n\n\n\n\nfrq(df_part_mod, prot_civil)\n\nprot_civil <categorical> \n# total N=4007 valid N=2975 mean=0.62 sd=0.49\n\nValue |    N | Raw % | Valid % | Cum. %\n---------------------------------------\n    0 | 1131 | 28.23 |   38.02 |  38.02\n    1 | 1844 | 46.02 |   61.98 | 100.00\n <NA> | 1032 | 25.75 |    <NA> |   <NA>\n\ndf_part_mod %>% \n  ggplot(aes(x = as.factor(prot_civil))) +\n  geom_bar(color = '#000000' , alpha = 0.5)+\n  labs(title = \"Figura 5. Gráfico de barras 'Evaluación Servicios Comuna 1'(prot_civil)\",\n       subtitle = str_wrap(\"Pregunta: '¿Cómo evaluaría usted la calidad de los siguientes servicios que existen en esta comuna? Protección civil, por ejemplo, frente a terremotos, inundaciones u otros desastres naturales'\"),\n       x= \"\", y = \"Frecuencia\") +\n  scale_x_discrete(breaks= c(\"0\", \"1\", NA),\n                   labels = c(\"Mala/Muy Mala\", \"Buena/Muy Buena\", \"No responde/No aploca\"))+\n  theme_minimal()\n\n\n\nVemos que en la mayoría de los casos la gente tiende a tener una\nbuena o decente evaluación de los servicios comunales, pero hay una\nmayor varianza en las evaluaciones de Protección civil, Seguridad\nCiudadana y Mantenimiento de calles. En la cuarta entrega se hará un\nanálisis de cuál de las cuatro variables tiene un mayor poder\nexplicativo que luego se transformará en una regresión para analizar su\nimpacto.\nLa variable de corrupción todavía no se ha podido conseguir una base\nde datos suficiente, por lo que su análisis se incluirá en un futuro,\nluego de los análisis preliminares.\n\n\n\n",
    "preview": "posts/2022-10-03-entrega-3-grficos-y-tablas/entrega-3-grficos-y-tablas_files/figure-html5/unnamed-chunk-3-1.png",
    "last_modified": "2022-10-26T17:08:19-03:00",
    "input_file": "entrega-3-grficos-y-tablas.knit.md"
  },
  {
    "path": "posts/2022-09-25-entrega-2-operacionalizaciones/",
    "title": "Entrega 2: operacionalizaciones",
    "description": "Segunda entrega para el trabajo de ICP5006",
    "author": [
      {
        "name": "Felipe Garrido",
        "url": "https://fgarrido-m.github.io/"
      }
    ],
    "date": "2022-09-25",
    "categories": [
      "Trabajo"
    ],
    "contents": "\nDadas las breves definiciones previas para el análisis que\ncomprenderá este trabajo, vale la pena hacer unas definiciones más\nexplícitas y extensas sobre que es lo que se considera. Nuevamente se\ncomprenderán tres variables principales: a) Participación ciudadana, b)\nConfianza en las instituciones y c) Corrupción. Además de esto se busca\npresentar una operacionalización de estas variables, es decir, como se\nbuscará producir la medición necesaria para lograr los objetivos de este\ntrabajo, explorar las relaciones que se producen entre la participación\nciudadana y la confianza en las instituciones y cuando toma relevancia\nla corrupción en el nivel subancional en Chile.\nA. Participación Ciudadana\ni. Definición\nDe una manera poco elegante la participación ciudadana implica\nnormalmente cualquier forma de participación que vaya más allá del mero\nhecho de votar en las elecciones rutinarias por representantes\npolíticos. Muchas veces es visto como una forma de profundizar la\ndemocracia dentro de les ciudadanes, dando rienda suelta a variadas\nversiones de democracia entre las que se encuentran deliberativa,\ndirecta, agonistica, etc. (Smith, 2009). En Chile la experiencia de la\nparticipación ciudadana es mediada por la existencia de la dictadura y\nsu definición de política que lo aleja de la población (De la Fuente,\n2013). La recuperación democrática en Chile implica la inclusión de la\ncuidadanía y un esfuerzo explícito por parte de los gobiernos de Lagos y\nBachelet de volver a llevar la democracia a la ciudadanía (De la Fuente,\n2013). Esto refleja las definiciones de democracia participativa que\nplantea Pateman (1970) cuando menciona la importancia de llevar\ninstancias democráticas a espacios cercanos para el común de las\npersonas cómo el lugar de empleo y los barrios. Debido a la dificultad\nchilena de sindicalización, una atadura de la época dictatorial, se toma\nla democracia participativa en esta otra dimensión, siendo importante lo\nterritorial, que se aplica fácilmente a lo que se busca medir en este\ntrabajo: el espacio subnacional.\nii. Operacionalización\nTomando en cuenta la breve definición hecha a sobre la participación\nciudadana en Chile, debemos analizar como es que vamos a medirla. En el\ncaso de este trabajo buscaremos la participación ciudadana en el barrio,\nen el territorio, finalmente en la comuna. Dada la experiencia previa en\notros trabajos, he visto como periódicamente se ha desarticulado la\nforma básica de participación ciudadana en Chile: la junta de vecinos.\nLa junta de vecinos tiene una larga data de existencia en el país,\napareciendo en 1887, con la Ley de Organización y Atribuciones\nMunicipales (Cáceres et al, 1983). Dada la historia chilena y la\nimportancia de la junta de vecinos como lugar de participación\ndemocrática primaria, en este trabajo se operacionalizará la\nParticipación Ciudadana como el nivel de participación en juntas de\nvecinos de cada comuna. Sin embargo, debido a la desarticulación de esta\ndurante la dictadura y los primeros diez años de democracia (De la\nFuente, 2013), se buscará complementar con participación en otros tipos\nde organizaciones, pero estrictamente al nivel comunal.\nB. Confianza en las\ninstituciones\ni. Definición\nComo fue mencionado previamente la fuente de esta variable se\nencuentra en la idea de la cultura política de Almond y Verba (1963). Se\ndefine la cultura política como un conjunto de orientaciones\nevaluativas, afectivas y cognitivas hacia una serie de objetos\npolíticos. Sin embargo hay otros estudios neurocientíficos posteriores\nque hacen dudar de las diferencias reales entre lo cognitivo y lo\nafectivo y su efecto en lo evaluativo (Marcus, 2013; Eagly y Chaiken,\n1998). A pesar de lo anterior, el punto de Almond y Verba (1963) se\nmantiene, particularmente con respecto a los objetos políticos hacia los\nque se manifiestan estas orientaciones. Para los autores son cuatro: 1.\nLa institucionalidad en sí, 2. El rol que tiene el individuo dentro de\nla política, 3. La forma en que se desarrolla la política y 4. Los\noutcomes de estos procesos políticos. Además, se menciona que puede\nhaber congruencia entre el tipo de sistema político y las orientaciones\nque tiene el individuo, sobretodo en términos de lealtad o alienación\nrespecto del sistema, dada si las orientaciones son positivas o\nnegativas.\nii. Operacionalización\nVemos que el concepto de cultura política de Almond y Verba abarca\nbastantes aspectos y que cada uno puede ser operacionalizado de una\nmanera en particular. Es más, ellos ya encuentran la posibilidad de la\nalienación como uno de los resultados de las orientaciones negativas\nhacia las instituciones. No está demás recordar como es que la\nalienación puede efectivamente cohibir la participación ciudadana en los\nespacios previamente mencionados. Dados los hallazgos previos que\nencontré en mi tesis, es coherente para los objetivos de esta\ninvestigación el trabajar analizando las orientaciones hacia el cuarto\ntipo de objeto político: los outputs. Esto debido a que se acerca más a\nlo que se busca modelar, como es que la valoración hacia las\nmunicipalidades y las consecuencias de su trabajo puede afectar la\nparticipación cidadana en otras áreas de participación ciudadana.\nEntonces lo que se quiere medir con esta variable es la percepción de la\nciudadanía hacia los outputs políticos de las municipalidades.\nC. Corrupción\ni. Definición\nParece ser que la corrupción es el concepto que es más fácil\ndescribir, pues puede ser definido como un abuso de confianza que\ngeneralmente involucra al poder público. Esta implica beneficios a\nprivados, que pueden implicar dinero, pero esto no es necesario. En este\ncaso estaríamos trabajando con una corrupción que Orellana (2004) ha\nconsiderado como subrepticia, pues funciona bajo los radares de las\ninstituciones en Chile. Más aún, a un nivel subnacional vemos el mismo\nfenómeno, pues la percepción de la corrupción en las municipalidades no\nha mejorado en el último tiempo (Bustos y Morales, 2014)\nii. Operacionalización\nDe las tres variables que se van a analizar una de las más difíciles\npara operacionalizar de manera directa es la corrupción. Esto es porque\ndebido a la forma en que esta funciona en la realidad y es como menciona\nOrellana (2004), es subrepticia, por lo que es difícil medirla de manera\nconcreta y fiable. Sin embargo, como es común dentro del estudio de la\ncorrupción no se debe medir la corrupción en sí, sino más bien la\npercepción de la ciudadanía, es decir, que tan corruptas son las\ninstituciones a los ojos de las personas. Esta es la misma\noperacionalización que crean por ejemplo Bustos y Morales (2014), pues\nven como la gente percibe sus instituciones locales. Esto es beneficioso\nen tanto que lo que nos importa es como la corrupción puede afectar a\nles ciudadanes y su participación, por lo que medir la percepción en vez\nde números objetivos no debería ser un problema.\nReferencias Bibiliográficas\nAlmond, G. A., & Verba, S. (1963). The civic culture: Political\nattitudes and democracy in five nations. Princeton University Press.\nBustos, M. & Morales, M. C. (2014). Una mirada a la ley de\ntransparencia en chile: Aspectos que condicionan su logro en lo\nmunicipal. Via Inveniendi Et Iudicandi, 9(2), 41-59. doi:https://doi-org.pucdechile.idm.oclc.org/10.15332/s1909-0528.2014.0002.02\nCáceres J., G. (1983). Algunos antecedentes sobre la génesis de las\njuntas de vecinos en Chile. Revista de trabajo social [artículo de\nrevista].\nDe la Fuente, G. (2013) Mitos y realidades de la participación\nciudadana en Chile. En De la Fuente, G. & Mlynarz, D. (Eds.) El\npueblo unido: mitos y realidades de la participación ciudaana en Chile.\n(pp. 15-38). Ediciones Universidad Alberto Hurtado.\nEagly, A. & Chaiken S. (1998) Attitude Structure and Function. En\nGilbert, D., S. Fiske & G. Lindzey (Eds.), The Handbook of Social\nPsychology (pp. 269-310). McGraw Hill.\nMarcus, G. E. (2013). Political psychology: Neuroscience, genetics,\nand politics. Oxford University Press.\nPateman, Carole (1970). Participation and Democratic Theory.\nCambridge: Cambridge University Press.\nOrellana Vargas, P. (2004). Probidad y corrupción en Chile. El punto\nde quiebre. Polis. Revista Latinoamericana, (8).\nSmith, G. (2009). Democratic innovations: Designing institutions for\ncitizen participation. Cambridge University Press.\n\n\n\n",
    "preview": {},
    "last_modified": "2022-10-03T12:53:25-03:00",
    "input_file": "entrega-2-operacionalizaciones.knit.md"
  },
  {
    "path": "posts/2022-10-13-entrega-4-primeras-regresiones/",
    "title": "Entrega 4: primeras regresiones",
    "description": "Cuarta entrega para el trabajo de ICP5006",
    "author": [
      {
        "name": "Felipe Garrido",
        "url": "https://fgarrido-m.github.io/"
      }
    ],
    "date": "2022-09-25",
    "categories": [
      "Trabajo"
    ],
    "contents": "\nPara continuar nuestra exploración de la base de datos de la EDTB, se\nrealizaran unas primeras regresiones para analizar de manera preeliminar\nlas relaciones entre las variables más esenciales. El tipo de regresión\na utilizar es una de tipo logit, debido a que la variable dependiente es\nuna variable de tipo categórica dummy, es decir, está o no está. En este\ncaso nuestra variable tiene dos posibilidades, participa o no en una\njunta de vecinos. Las columnas utilizamos para describir nuestra\nvariable de outputs políticos son preguntas del 1 al 4 en términos de\npercepción de la entrega de estos servicios de parte de la población.\nEstas variables fueron recodificadas para que fuesen binarias, es decir,\nque tomen un valor de un 0 o un 1, “1” significa que tienen una\nevaluación buena o muy buena de los servicios. Inicialmente se correran\ncinco regresiones, una con cada una de las variables y una final con las\ncuatro juntas. Ningún otra variable quedará en este análisis\ninicial.\n\n\nlibrary(tidyverse)\nlibrary(sjmisc)\nlibrary(lubridate)\nlibrary(labelled)\nlibrary(corrplot)\nlibrary(margins)\nlibrary(prediction)\nlibrary(texreg)\nlibrary(jtools)\nlibrary(pscl)\nlibrary(broom)\nlibrary(plotROC)\n\n\n\n\ndf_part_mod <- readRDS(\"especiales_1_acotadas.rds\")\n\nskimr::skim(df_part_mod, j_vecinos, guardia_muni, rec_basura, mant_calles, prot_civil)\n\nTable 1: Data summary\nName\ndf_part_mod\nNumber of rows\n4007\nNumber of columns\n23\n_______________________\n\nColumn type frequency:\n\nfactor\n5\n________________________\n\nGroup variables\nNone\nVariable type: factor\nskim_variable\nn_missing\ncomplete_rate\nordered\nn_unique\ntop_counts\nj_vecinos\n65\n0.98\nFALSE\n2\n0: 3064, 1: 878\nguardia_muni\n871\n0.78\nFALSE\n2\n1: 1980, 0: 1156\nrec_basura\n101\n0.97\nFALSE\n2\n1: 3233, 0: 673\nmant_calles\n143\n0.96\nFALSE\n2\n1: 2378, 0: 1486\nprot_civil\n1032\n0.74\nFALSE\n2\n1: 1844, 0: 1131\n\n\n\nmodelo_1 <- glm(j_vecinos ~ guardia_muni, \n                data = df_part_mod,\n                family = binomial(\"logit\"))\n\nmodelo_2 <- glm(j_vecinos ~ rec_basura, \n                data = df_part_mod,\n                family = binomial(\"logit\"))\n\nmodelo_3 <- glm(j_vecinos ~ mant_calles, \n                data = df_part_mod,\n                family = binomial(\"logit\"))\n                \nmodelo_4 <- glm(j_vecinos ~ prot_civil, \n                data = df_part_mod,\n                family = binomial(\"logit\"))\n\nmodelo_5 <- glm(j_vecinos ~ guardia_muni + rec_basura + mant_calles + prot_civil, \n                data = df_part_mod,\n                family = binomial(\"logit\"))\n\nmodelos <- list(modelo_1, modelo_2, modelo_3, modelo_4, modelo_5)\n\n\n\n\nscreenreg(modelos)\n\n\n====================================================================================\n                Model 1       Model 2       Model 3       Model 4       Model 5     \n------------------------------------------------------------------------------------\n(Intercept)        -1.18 ***     -1.16 ***     -1.08 ***     -1.08 ***     -1.12 ***\n                   (0.07)        (0.09)        (0.06)        (0.07)        (0.13)   \nguardia_muni1      -0.22 *                                                 -0.05    \n                   (0.09)                                                  (0.11)   \nrec_basura1                      -0.14                                      0.12    \n                                 (0.10)                                    (0.14)   \nmant_calles1                                   -0.29 ***                   -0.18    \n                                               (0.08)                      (0.12)   \nprot_civil1                                                  -0.28 **      -0.23 *  \n                                                             (0.09)        (0.11)   \n------------------------------------------------------------------------------------\nAIC              3199.91       4047.72       4014.19       3110.78       2633.48    \nBIC              3211.98       4060.23       4026.68       3122.75       2662.70    \nLog Likelihood  -1597.95      -2021.86      -2005.09      -1553.39      -1311.74    \nDeviance         3195.91       4043.72       4010.19       3106.78       2623.48    \nNum. obs.        3099          3852          3803          2935          2550       \n====================================================================================\n*** p < 0.001; ** p < 0.01; * p < 0.05\n\nCómo podemos apreciar, todas las variables tienen significancia\nestadística, exceptuando la variable que mide la percpeción del servicio\nde Recolección de Basura. Cuando medimos las cinco variables juntas\nvemos que la única que tiene significancia estadística es la percepción\ndel servicio de Protección Civil en casos de emergencia, esto se puede\ndeber a que las cuatro variables estén altamente correlacionadas. Esto\nnos indica que a futuro lo mejor que se puede hacer es un índice de las\ncuatro variables. En términos de direccionalidad es contrario a lo que\ninicialmente se esperaría dada las observaciones previo al análisis de\ndatos, pues vemos que cuando sube la evaluación de los datos, baja la\nprobabilidad de que el individuo participe en las juntas de vecinos.\nEsto mismo vemos cuando analizamos los Odds de las regresiones:\n\n\nexp(coef(modelo_1))\n\n  (Intercept) guardia_muni1 \n    0.3084005     0.8018735 \n\nexp(coef(modelo_2))\n\n(Intercept) rec_basura1 \n  0.3127490   0.8733073 \n\nexp(coef(modelo_3))\n\n (Intercept) mant_calles1 \n   0.3391705    0.7469203 \n\nexp(coef(modelo_4))\n\n(Intercept) prot_civil1 \n  0.3401937   0.7561029 \n\nPor ejemplo, cuando una persona tiene una evaluación positiva de la\nguardia municipal, la probabilidad de que participe en una junta de\nvecinos es de 0.8, lo que en términos de probabilidad, significa que\ndisminuye. Este patrón se ve en todas las variables, aunque entre las\nque son significativas (todas menos Recolección de Basura), la que tiene\nun Odd más grande es la evaluación de la Guardia Municipal. En términos\nde comportamiento esto nos indica que las personas tienden a participar\nmás en las juntas de vecinos cuando las evaluaciones de los servicios\npúblicos de la comuna son negativos. Sin embargo, todavía no hemos hecho\nel análisis cruzando los datos con la perpeción de corrupción.\nEsto nos lleva a plantear nuestro modelo que luego va a ser utilizado\nen el resto del trabajo:\n\\[ParticipaciónJuntasdeVecinos = \\alpha +\n\\ Evaluación ServiciosX_1+ \\\\ Participación Elecciónes X_2 + Cohesión\nVecinalX_3 \\\\ Interés en Asuntos Políticos X_4 + Percepción de la\nCorrupción X_5+  \\mu  \\]\nLas variables de Evaluación de Servicios y Cohesión Vecinal serán\níndices. Evaluación de Servicios implican las variables ya evaluadas,\nCohesión Vecinal incluye preguntas respecto a la cantidad de números de\nteléfonos de vecinos que tiene el individuo (n_telefono), si le pide\nayuda a vecinos en casos de necesidad (coop_vecinos) y nivel de\nconfianza en los vecinos (confianza). Interés en Asuntos Políticos se\nmedirá con la variable ‘asuntos’, que pregunta directamente esto y\nParticipación Electoral se pregunta si se voto en las últimas elecciones\nen la variable ‘voto’.\nEn términos de hipótesis, se espera que cuando haya una buena\nEvaluación de Servicios, haya poca probabilidad de participar en juntas\nde vecinos, cuando hay más Cohesión Vecinal, es más probable que\nparticipe en juntas de vecinos, cuando hay Participación Electoral, haya\nmás probabilidad de participar en juntas de vecinos y cuando haya más\nInterés en Asuntos Políticos haya más probabilidad de participar en\njuntas de vecinos.\nDada las experiencias pasadas, que llevaron a estudiar el tema\npresente, se espera que la interacción con Corrupción será más\ncomplicada. Se espera que cuando haya una alta percepción de la\ncorrupción se de vuelta la relación de la Evaluación de Servicios, es\ndecir, cuando haya una Percepción de la Corrupción más alta, el tener\nuna alta Evaluación de Servicios imlpique que sea más probable que\nparticipe el individuo en la junta de vecinos. La lógica tras esta\nhipótesis es que cuando hay una alta corrupción y una mala evaluación de\nlos servicios en la mente del individuo no valga la pena el participar\nen juntas de vecinos, pues no se logrará nada haciéndolo.\n\n\n\n",
    "preview": {},
    "last_modified": "2022-10-26T17:07:49-03:00",
    "input_file": "entrega-4-primeras-regresiones.knit.md"
  },
  {
    "path": "posts/2022-09-01-entrega-1-definiciones/",
    "title": "Entrega 1: definiciones",
    "description": "Primera entrega para el trabajo de ICP5006",
    "author": [
      {
        "name": "Felipe Garrido",
        "url": "https://fgarrido-m.github.io/"
      }
    ],
    "date": "2022-09-01",
    "categories": [
      "Trabajo"
    ],
    "contents": "\nEl trabajo que se desarrollará durante el semestre proviene de un\ninterés tanto en la participación ciudadana, confianza en las\ninstituciones, como la corrupción, en el ámbito de la política\nsubnacional chilena. En la tesis que desarrollé en 2021 se encuentra que\nunas de las potenciales razones para la participación ciudadana en la\ncomuna de Lo Barnechea es la efectividad de la municipalidad para\ncumplir con sus obligaciones, esto a pesar de los casos de corrupción\nconocidos por los vecinos. Esto se contrasta con Estación Central, cuya\npoblación desconfía de la institucionalidad por lo que no participa\nactivamente en espacios como son las juntas de vecinos. Surge la duda\nfinalmente si es que en el resto del territorio chileno se cumple esta\nrelación, es decir, esta dinámica es normal en todas las comunas y\nmunicipalidades de Chile.\nPara esto definimos entonces un número de variables de interés para\neste trabajo:\na) Participación ciudadana\nParticipación ciudadana en estos casos no refiere exclusivamente a la\nparticipación en los espacios clásicos como el voto durante las\nelecciones rutinarias. La idea es medir también la participación en los\nespacios de democracia directa y participativa, como son las juntas de\nvecinos y otras organizaciones de la sociedad civil a nivel local.\nb) Confianza en las\ninstituciones\nUno de los objetivos del trabajo que se buscará durante el semestre\nes encontrar la mejor forma de medir la apreciación de la ciudadanía en\nsus instituciones. En este caso lo que nos interesa es la municipalidad\ny cuales son las apreciaciones de las personas hacia esta política local\ny como es que esta potencialmente afecta la participación ciudadana de\nlos vecinos. Esto finalmente entra dentro del marco de la cultura\npolítica que se puede desarrollar dentro de un subdivisión territorial\ncomo es una comuna, la cultura política se va a entender bajo lo que\nplantean Almond y Verba en su texto clásico de 1980 The Civic\nCulture\nc) Corrupción\nUno de los grandes problemas de la sociedad moderna es la percepción\nde la corrupción en las instituciones democráticas. Sin embargo, dado a\nlo encontrado en mi previa investigación de carácter más cualitativo hay\ncasos en que la corrupción no parece ser un problema sustantivo para los\nvecinos. En este sentido esta variable entra en el estudio con el\nobjetivo de analizar si es que es efectivamente una variable\ninterviniente en la apreciación de las instituciones y en la\nparticipación ciudadana.\n\n\n\n",
    "preview": {},
    "last_modified": "2022-09-08T18:45:06-04:00",
    "input_file": "entrega-1-definiciones.knit.md"
  },
  {
    "path": "posts/2022-08-25-valor-p/",
    "title": "Valor P",
    "description": "Es solo una prueba de lo que se hace en el taller de valor-p",
    "author": [
      {
        "name": "Felipe Garrido",
        "url": "https://fgarrido-m.github.io/"
      }
    ],
    "date": "2022-08-18",
    "categories": [
      "Talleres"
    ],
    "contents": "\n\n\nlibrary(tidyverse)\nlibrary(sjmisc)\nlibrary(haven)\nlibrary(kableExtra)\n\n\n\n\ndf_lapop_chile <- readRDS(\"lapop_chile_220824.rds\")\n\n\n\n\nhistograma <- df_lapop_chile %>% \n  ggplot(aes(x = q2)) +\n  geom_histogram()\n\nhistograma\n\n\n\n\n\ndf_lapop_chile %>% \n  ggplot(aes(x = q2)) +\n  geom_histogram() +\n  facet_grid(~year) +\n  theme_minimal()\n\n\n\n\n\n\n",
    "preview": "posts/2022-08-25-valor-p/valor-p_files/figure-html5/unnamed-chunk-2-1.png",
    "last_modified": "2022-08-25T19:45:21-04:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to paradais",
    "description": "Welcome to our new blog, paradais. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Felipe Garrido",
        "url": "https://fgarrido-m.github.io/"
      }
    ],
    "date": "2022-08-18",
    "categories": [],
    "contents": "\n\n\n\n",
    "preview": {},
    "last_modified": "2022-08-25T19:44:51-04:00",
    "input_file": {}
  }
]
