[
  {
    "path": "posts/2022-10-03-entrega-3-grficos-y-tablas/",
    "title": "Entrega 3: gráficos y tablas",
    "description": "Tercera entrega para el trabajo de ICP5006",
    "author": [
      {
        "name": "Felipe Garrido",
        "url": "https://fgarrido-m.github.io/"
      }
    ],
    "date": "2022-10-03",
    "categories": [
      "Trabajo"
    ],
    "contents": "\n\n\n\nPara poder medir las dos primeras variables, se utiliza una base de\ndatos desarrollada por RIMISP en base a la Encuesta de Dinámicas\nTerritoriales y Bienestar -EDTB- (La base de datos se puede encontrar en\nel siguiente link: https://dataverse.harvard.edu/dataset.xhtml?persistentId=doi:10.7910/DVN/G9ENDE).\nEsta encuesta se realiza en comunas de cuidades medianas y pequeñas de\ntres países, pero dividen las bases de datos según países, siendo la que\nse utiliza la chilena. Si bien esto tiene algunas debilidades, debido a\nque no es explorable hacia ciudades más grandes, si da la posibilidad de\nexplorar las situaciones de comunas más pequeñas. Estos históricamente\nhan sido desfavorecidas, para dar espacio al estudio de comunas más\ngrandes, en particular las que corresponden a la ciudad de Santiago.\nLa EDTB pregunta una serie de información a vecinos de estas comunas\nsobre el bienestar y características sociodemográficas, pero para esto\nrealizamos una serie de filtros para dejar las preguntas más relevantes.\nSe dejan algunas de las preguntas básicas sobre género, nivel\neducacional, nombre de la comuna y otros. Además se deja la pregunta\nl_15h que consulta sobre la participación del vecino en organzaciones\nvecinales, principalmente juntas de vecinos. Además hay preguntas sobre\nlos outputs políticos en la entrega de servicios como la seguridad,\nrecolección de basura, mantenimiento de calles y protección civil\n(1_19a, b, c y d). Esto nos deja con las variables que más se requieren\npara esta investigación. Otras variables que podrían ser interesantes en\nel futuro son si participan en las elecciones municipales (l_1 y l_5),\ninterés en asuntos políticos (l_6, l_8), medición de cohesión vecinal\n(l_12,l_16a, l_20g), acercamiento a autoridades (l_16b) y satisfacción\ncon la comunidad y sus autoridades (m_3d, e y f). Primero se hará una\nmodificación de las variables necesarias.\n\n1 variables were not found in the dataset: L_6\n\nEl primer gráfico a analizar es el de la participación en\norganizaciones vecinales. La pregunta está dispuesta en una respuesta\ndicotómica y vemos que la gran mayoría de personas no participan en\norganizaciones vecinales.\n\n\ndf_part_mod %>% \n  ggplot(aes(x = as.factor(j_vecinos))) +\n  geom_bar(color = '#000000' , alpha = 0.5)+\n  labs(title = \"Figura 1. Gráfico de barras 'Participación en organización vecinal'(j_vecinos)\",\n       subtitle = str_wrap(\"Pregunta: '¿En el último año usted ha participado de manera activa en alguno de los siguientes grupos u organizaciones? Organización vecinal (asociación de vivienda o junta de vecinos)'\", 70),\n       x= \"\", y = \"Frecuencia\") +\n  scale_x_discrete(breaks= c(\"1\", \"0\", NA),\n                   labels = c(\"Si\", \"No\", \"No sabe/No responde\"))+\n  theme_minimal()\n\n\n\nLuego vemos las variables que miden la evaluación de servicios\ncomunales, lo cual puede ser entendido como una evaluación de los\noutputs políticos definidos en la segunda entrega.\n\n\nfrq(df_part_mod, guardia_muni)\n\nguardia_muni <categorical> \n# total N=4007 valid N=3136 mean=0.63 sd=0.48\n\nValue |    N | Raw % | Valid % | Cum. %\n---------------------------------------\n    0 | 1156 | 28.85 |   36.86 |  36.86\n    1 | 1980 | 49.41 |   63.14 | 100.00\n <NA> |  871 | 21.74 |    <NA> |   <NA>\n\ndf_part_mod %>% \n  ggplot(aes(x = as.factor(guardia_muni))) +\n  geom_bar(color = '#000000' , alpha = 0.5)+\n  labs(title = \"Figura 2. Gráfico de barras 'Evaluación Servicios Comuna 1'(guardia_muni)\",\n       subtitle = str_wrap(\"Pregunta: '¿Cómo evaluaría usted la calidad de los siguientes servicios que existen en esta comuna? Seguridad Ciudadana (Guardia Municipal)'\"),\n       x= \"\", y = \"Frecuencia\") +\n  scale_x_discrete(breaks= c(\"0\", \"1\", NA),\n                   labels = c(\"Mala/Muy Mala\", \"Buena/Muy Buena\", \"No responde/No aplica\"))+\n  theme_minimal()\n\n\n\n\n\nfrq(df_part_mod, rec_basura)\n\nrec_basura <categorical> \n# total N=4007 valid N=3906 mean=0.83 sd=0.38\n\nValue |    N | Raw % | Valid % | Cum. %\n---------------------------------------\n    0 |  673 | 16.80 |   17.23 |  17.23\n    1 | 3233 | 80.68 |   82.77 | 100.00\n <NA> |  101 |  2.52 |    <NA> |   <NA>\n\ndf_part_mod %>% \n  ggplot(aes(x = as.factor(rec_basura))) +\n  geom_bar(color = '#000000' , alpha = 0.5)+\n  labs(title = \"Figura 3. Gráfico de barras 'Evaluación Servicios Comuna 1'(rec_basura)\",\n       subtitle = str_wrap(\"Pregunta: '¿Cómo evaluaría usted la calidad de los siguientes servicios que existen en esta comuna? Recolección de basura'\"),\n       x= \"\", y = \"Frecuencia\") +\n  scale_x_discrete(breaks= c(\"0\", \"1\", NA),\n                   labels = c(\"Mala/Muy Mala\",\"Buena/Muy Buena\", \"No responde/No aplica\"))+\n  theme_minimal()\n\n\n\n\n\nfrq(df_part_mod, mant_calles)\n\nmant_calles <categorical> \n# total N=4007 valid N=3864 mean=0.62 sd=0.49\n\nValue |    N | Raw % | Valid % | Cum. %\n---------------------------------------\n    0 | 1486 | 37.09 |   38.46 |  38.46\n    1 | 2378 | 59.35 |   61.54 | 100.00\n <NA> |  143 |  3.57 |    <NA> |   <NA>\n\ndf_part_mod %>% \n  ggplot(aes(x = as.factor(mant_calles))) +\n  geom_bar(color = '#000000' , alpha = 0.5)+\n  labs(title = \"Figura 4. Gráfico de barras 'Evaluación Servicios Comuna 1'(mant_calles)\",\n       subtitle = str_wrap(\"Pregunta: '¿Cómo evaluaría usted la calidad de los siguientes servicios que existen en esta comuna? Mantenimiento de calles y vias'\"),\n       x= \"\", y = \"Frecuencia\") +\n  scale_x_discrete(breaks= c(\"0\", \"1\", NA),\n                   labels = c(\"Mala/Muy Mala\", \"Buena/Muy Buena\", \"No responde/No aplica\"))+\n  theme_minimal()\n\n\n\n\n\nfrq(df_part_mod, prot_civil)\n\nprot_civil <categorical> \n# total N=4007 valid N=2975 mean=0.62 sd=0.49\n\nValue |    N | Raw % | Valid % | Cum. %\n---------------------------------------\n    0 | 1131 | 28.23 |   38.02 |  38.02\n    1 | 1844 | 46.02 |   61.98 | 100.00\n <NA> | 1032 | 25.75 |    <NA> |   <NA>\n\ndf_part_mod %>% \n  ggplot(aes(x = as.factor(prot_civil))) +\n  geom_bar(color = '#000000' , alpha = 0.5)+\n  labs(title = \"Figura 5. Gráfico de barras 'Evaluación Servicios Comuna 1'(prot_civil)\",\n       subtitle = str_wrap(\"Pregunta: '¿Cómo evaluaría usted la calidad de los siguientes servicios que existen en esta comuna? Protección civil, por ejemplo, frente a terremotos, inundaciones u otros desastres naturales'\"),\n       x= \"\", y = \"Frecuencia\") +\n  scale_x_discrete(breaks= c(\"0\", \"1\", NA),\n                   labels = c(\"Mala/Muy Mala\", \"Buena/Muy Buena\", \"No responde/No aploca\"))+\n  theme_minimal()\n\n\n\nVemos que en la mayoría de los casos la gente tiende a tener una\nbuena o decente evaluación de los servicios comunales, pero hay una\nmayor varianza en las evaluaciones de Protección civil, Seguridad\nCiudadana y Mantenimiento de calles. En la cuarta entrega se hará un\nanálisis de cuál de las cuatro variables tiene un mayor poder\nexplicativo que luego se transformará en una regresión para analizar su\nimpacto.\nLa variable de corrupción todavía no se ha podido conseguir una base\nde datos suficiente, por lo que su análisis se incluirá en un futuro,\nluego de los análisis preliminares.\n\n\n\n",
    "preview": "posts/2022-10-03-entrega-3-grficos-y-tablas/entrega-3-grficos-y-tablas_files/figure-html5/unnamed-chunk-3-1.png",
    "last_modified": "2022-10-26T17:08:19-03:00",
    "input_file": "entrega-3-grficos-y-tablas.knit.md"
  },
  {
    "path": "posts/2022-09-25-entrega-2-operacionalizaciones/",
    "title": "Entrega 2: operacionalizaciones",
    "description": "Segunda entrega para el trabajo de ICP5006",
    "author": [
      {
        "name": "Felipe Garrido",
        "url": "https://fgarrido-m.github.io/"
      }
    ],
    "date": "2022-09-25",
    "categories": [
      "Trabajo"
    ],
    "contents": "\nDadas las breves definiciones previas para el análisis que\ncomprenderá este trabajo, vale la pena hacer unas definiciones más\nexplícitas y extensas sobre que es lo que se considera. Nuevamente se\ncomprenderán tres variables principales: a) Participación ciudadana, b)\nConfianza en las instituciones y c) Corrupción. Además de esto se busca\npresentar una operacionalización de estas variables, es decir, como se\nbuscará producir la medición necesaria para lograr los objetivos de este\ntrabajo, explorar las relaciones que se producen entre la participación\nciudadana y la confianza en las instituciones y cuando toma relevancia\nla corrupción en el nivel subancional en Chile.\nA. Participación Ciudadana\ni. Definición\nDe una manera poco elegante la participación ciudadana implica\nnormalmente cualquier forma de participación que vaya más allá del mero\nhecho de votar en las elecciones rutinarias por representantes\npolíticos. Muchas veces es visto como una forma de profundizar la\ndemocracia dentro de les ciudadanes, dando rienda suelta a variadas\nversiones de democracia entre las que se encuentran deliberativa,\ndirecta, agonistica, etc. (Smith, 2009). En Chile la experiencia de la\nparticipación ciudadana es mediada por la existencia de la dictadura y\nsu definición de política que lo aleja de la población (De la Fuente,\n2013). La recuperación democrática en Chile implica la inclusión de la\ncuidadanía y un esfuerzo explícito por parte de los gobiernos de Lagos y\nBachelet de volver a llevar la democracia a la ciudadanía (De la Fuente,\n2013). Esto refleja las definiciones de democracia participativa que\nplantea Pateman (1970) cuando menciona la importancia de llevar\ninstancias democráticas a espacios cercanos para el común de las\npersonas cómo el lugar de empleo y los barrios. Debido a la dificultad\nchilena de sindicalización, una atadura de la época dictatorial, se toma\nla democracia participativa en esta otra dimensión, siendo importante lo\nterritorial, que se aplica fácilmente a lo que se busca medir en este\ntrabajo: el espacio subnacional.\nii. Operacionalización\nTomando en cuenta la breve definición hecha a sobre la participación\nciudadana en Chile, debemos analizar como es que vamos a medirla. En el\ncaso de este trabajo buscaremos la participación ciudadana en el barrio,\nen el territorio, finalmente en la comuna. Dada la experiencia previa en\notros trabajos, he visto como periódicamente se ha desarticulado la\nforma básica de participación ciudadana en Chile: la junta de vecinos.\nLa junta de vecinos tiene una larga data de existencia en el país,\napareciendo en 1887, con la Ley de Organización y Atribuciones\nMunicipales (Cáceres et al, 1983). Dada la historia chilena y la\nimportancia de la junta de vecinos como lugar de participación\ndemocrática primaria, en este trabajo se operacionalizará la\nParticipación Ciudadana como el nivel de participación en juntas de\nvecinos de cada comuna. Sin embargo, debido a la desarticulación de esta\ndurante la dictadura y los primeros diez años de democracia (De la\nFuente, 2013), se buscará complementar con participación en otros tipos\nde organizaciones, pero estrictamente al nivel comunal.\nB. Confianza en las\ninstituciones\ni. Definición\nComo fue mencionado previamente la fuente de esta variable se\nencuentra en la idea de la cultura política de Almond y Verba (1963). Se\ndefine la cultura política como un conjunto de orientaciones\nevaluativas, afectivas y cognitivas hacia una serie de objetos\npolíticos. Sin embargo hay otros estudios neurocientíficos posteriores\nque hacen dudar de las diferencias reales entre lo cognitivo y lo\nafectivo y su efecto en lo evaluativo (Marcus, 2013; Eagly y Chaiken,\n1998). A pesar de lo anterior, el punto de Almond y Verba (1963) se\nmantiene, particularmente con respecto a los objetos políticos hacia los\nque se manifiestan estas orientaciones. Para los autores son cuatro: 1.\nLa institucionalidad en sí, 2. El rol que tiene el individuo dentro de\nla política, 3. La forma en que se desarrolla la política y 4. Los\noutcomes de estos procesos políticos. Además, se menciona que puede\nhaber congruencia entre el tipo de sistema político y las orientaciones\nque tiene el individuo, sobretodo en términos de lealtad o alienación\nrespecto del sistema, dada si las orientaciones son positivas o\nnegativas.\nii. Operacionalización\nVemos que el concepto de cultura política de Almond y Verba abarca\nbastantes aspectos y que cada uno puede ser operacionalizado de una\nmanera en particular. Es más, ellos ya encuentran la posibilidad de la\nalienación como uno de los resultados de las orientaciones negativas\nhacia las instituciones. No está demás recordar como es que la\nalienación puede efectivamente cohibir la participación ciudadana en los\nespacios previamente mencionados. Dados los hallazgos previos que\nencontré en mi tesis, es coherente para los objetivos de esta\ninvestigación el trabajar analizando las orientaciones hacia el cuarto\ntipo de objeto político: los outputs. Esto debido a que se acerca más a\nlo que se busca modelar, como es que la valoración hacia las\nmunicipalidades y las consecuencias de su trabajo puede afectar la\nparticipación cidadana en otras áreas de participación ciudadana.\nEntonces lo que se quiere medir con esta variable es la percepción de la\nciudadanía hacia los outputs políticos de las municipalidades.\nC. Corrupción\ni. Definición\nParece ser que la corrupción es el concepto que es más fácil\ndescribir, pues puede ser definido como un abuso de confianza que\ngeneralmente involucra al poder público. Esta implica beneficios a\nprivados, que pueden implicar dinero, pero esto no es necesario. En este\ncaso estaríamos trabajando con una corrupción que Orellana (2004) ha\nconsiderado como subrepticia, pues funciona bajo los radares de las\ninstituciones en Chile. Más aún, a un nivel subnacional vemos el mismo\nfenómeno, pues la percepción de la corrupción en las municipalidades no\nha mejorado en el último tiempo (Bustos y Morales, 2014)\nii. Operacionalización\nDe las tres variables que se van a analizar una de las más difíciles\npara operacionalizar de manera directa es la corrupción. Esto es porque\ndebido a la forma en que esta funciona en la realidad y es como menciona\nOrellana (2004), es subrepticia, por lo que es difícil medirla de manera\nconcreta y fiable. Sin embargo, como es común dentro del estudio de la\ncorrupción no se debe medir la corrupción en sí, sino más bien la\npercepción de la ciudadanía, es decir, que tan corruptas son las\ninstituciones a los ojos de las personas. Esta es la misma\noperacionalización que crean por ejemplo Bustos y Morales (2014), pues\nven como la gente percibe sus instituciones locales. Esto es beneficioso\nen tanto que lo que nos importa es como la corrupción puede afectar a\nles ciudadanes y su participación, por lo que medir la percepción en vez\nde números objetivos no debería ser un problema.\nReferencias Bibiliográficas\nAlmond, G. A., & Verba, S. (1963). The civic culture: Political\nattitudes and democracy in five nations. Princeton University Press.\nBustos, M. & Morales, M. C. (2014). Una mirada a la ley de\ntransparencia en chile: Aspectos que condicionan su logro en lo\nmunicipal. Via Inveniendi Et Iudicandi, 9(2), 41-59. doi:https://doi-org.pucdechile.idm.oclc.org/10.15332/s1909-0528.2014.0002.02\nCáceres J., G. (1983). Algunos antecedentes sobre la génesis de las\njuntas de vecinos en Chile. Revista de trabajo social [artículo de\nrevista].\nDe la Fuente, G. (2013) Mitos y realidades de la participación\nciudadana en Chile. En De la Fuente, G. & Mlynarz, D. (Eds.) El\npueblo unido: mitos y realidades de la participación ciudaana en Chile.\n(pp. 15-38). Ediciones Universidad Alberto Hurtado.\nEagly, A. & Chaiken S. (1998) Attitude Structure and Function. En\nGilbert, D., S. Fiske & G. Lindzey (Eds.), The Handbook of Social\nPsychology (pp. 269-310). McGraw Hill.\nMarcus, G. E. (2013). Political psychology: Neuroscience, genetics,\nand politics. Oxford University Press.\nPateman, Carole (1970). Participation and Democratic Theory.\nCambridge: Cambridge University Press.\nOrellana Vargas, P. (2004). Probidad y corrupción en Chile. El punto\nde quiebre. Polis. Revista Latinoamericana, (8).\nSmith, G. (2009). Democratic innovations: Designing institutions for\ncitizen participation. Cambridge University Press.\n\n\n\n",
    "preview": {},
    "last_modified": "2022-10-03T12:53:25-03:00",
    "input_file": "entrega-2-operacionalizaciones.knit.md"
  },
  {
    "path": "posts/2022-10-13-entrega-4-primeras-regresiones/",
    "title": "Entrega 4: primeras regresiones",
    "description": "Cuarta entrega para el trabajo de ICP5006",
    "author": [
      {
        "name": "Felipe Garrido",
        "url": "https://fgarrido-m.github.io/"
      }
    ],
    "date": "2022-09-25",
    "categories": [
      "Trabajo"
    ],
    "contents": "\nPara continuar nuestra exploración de la base de datos de la EDTB, se\nrealizaran unas primeras regresiones para analizar de manera preeliminar\nlas relaciones entre las variables más esenciales. El tipo de regresión\na utilizar es una de tipo logit, debido a que la variable dependiente es\nuna variable de tipo categórica dummy, es decir, está o no está. En este\ncaso nuestra variable tiene dos posibilidades, participa o no en una\njunta de vecinos. Las columnas utilizamos para describir nuestra\nvariable de outputs políticos son preguntas del 1 al 4 en términos de\npercepción de la entrega de estos servicios de parte de la población.\nEstas variables fueron recodificadas para que fuesen binarias, es decir,\nque tomen un valor de un 0 o un 1, “1” significa que tienen una\nevaluación buena o muy buena de los servicios. Inicialmente se correran\ncinco regresiones, una con cada una de las variables y una final con las\ncuatro juntas. Ningún otra variable quedará en este análisis\ninicial.\n\n\nlibrary(tidyverse)\nlibrary(sjmisc)\nlibrary(lubridate)\nlibrary(labelled)\nlibrary(corrplot)\nlibrary(margins)\nlibrary(prediction)\nlibrary(texreg)\nlibrary(jtools)\nlibrary(pscl)\nlibrary(broom)\nlibrary(plotROC)\n\n\n\n\ndf_part_mod <- readRDS(\"especiales_1_acotadas.rds\")\n\nskimr::skim(df_part_mod, j_vecinos, guardia_muni, rec_basura, mant_calles, prot_civil)\n\nTable 1: Data summary\nName\ndf_part_mod\nNumber of rows\n4007\nNumber of columns\n23\n_______________________\n\nColumn type frequency:\n\nfactor\n5\n________________________\n\nGroup variables\nNone\nVariable type: factor\nskim_variable\nn_missing\ncomplete_rate\nordered\nn_unique\ntop_counts\nj_vecinos\n65\n0.98\nFALSE\n2\n0: 3064, 1: 878\nguardia_muni\n871\n0.78\nFALSE\n2\n1: 1980, 0: 1156\nrec_basura\n101\n0.97\nFALSE\n2\n1: 3233, 0: 673\nmant_calles\n143\n0.96\nFALSE\n2\n1: 2378, 0: 1486\nprot_civil\n1032\n0.74\nFALSE\n2\n1: 1844, 0: 1131\n\n\n\nmodelo_1 <- glm(j_vecinos ~ guardia_muni, \n                data = df_part_mod,\n                family = binomial(\"logit\"))\n\nmodelo_2 <- glm(j_vecinos ~ rec_basura, \n                data = df_part_mod,\n                family = binomial(\"logit\"))\n\nmodelo_3 <- glm(j_vecinos ~ mant_calles, \n                data = df_part_mod,\n                family = binomial(\"logit\"))\n                \nmodelo_4 <- glm(j_vecinos ~ prot_civil, \n                data = df_part_mod,\n                family = binomial(\"logit\"))\n\nmodelo_5 <- glm(j_vecinos ~ guardia_muni + rec_basura + mant_calles + prot_civil, \n                data = df_part_mod,\n                family = binomial(\"logit\"))\n\nmodelos <- list(modelo_1, modelo_2, modelo_3, modelo_4, modelo_5)\n\n\n\n\nscreenreg(modelos)\n\n\n====================================================================================\n                Model 1       Model 2       Model 3       Model 4       Model 5     \n------------------------------------------------------------------------------------\n(Intercept)        -1.18 ***     -1.16 ***     -1.08 ***     -1.08 ***     -1.12 ***\n                   (0.07)        (0.09)        (0.06)        (0.07)        (0.13)   \nguardia_muni1      -0.22 *                                                 -0.05    \n                   (0.09)                                                  (0.11)   \nrec_basura1                      -0.14                                      0.12    \n                                 (0.10)                                    (0.14)   \nmant_calles1                                   -0.29 ***                   -0.18    \n                                               (0.08)                      (0.12)   \nprot_civil1                                                  -0.28 **      -0.23 *  \n                                                             (0.09)        (0.11)   \n------------------------------------------------------------------------------------\nAIC              3199.91       4047.72       4014.19       3110.78       2633.48    \nBIC              3211.98       4060.23       4026.68       3122.75       2662.70    \nLog Likelihood  -1597.95      -2021.86      -2005.09      -1553.39      -1311.74    \nDeviance         3195.91       4043.72       4010.19       3106.78       2623.48    \nNum. obs.        3099          3852          3803          2935          2550       \n====================================================================================\n*** p < 0.001; ** p < 0.01; * p < 0.05\n\nCómo podemos apreciar, todas las variables tienen significancia\nestadística, exceptuando la variable que mide la percpeción del servicio\nde Recolección de Basura. Cuando medimos las cinco variables juntas\nvemos que la única que tiene significancia estadística es la percepción\ndel servicio de Protección Civil en casos de emergencia, esto se puede\ndeber a que las cuatro variables estén altamente correlacionadas. Esto\nnos indica que a futuro lo mejor que se puede hacer es un índice de las\ncuatro variables. En términos de direccionalidad es contrario a lo que\ninicialmente se esperaría dada las observaciones previo al análisis de\ndatos, pues vemos que cuando sube la evaluación de los datos, baja la\nprobabilidad de que el individuo participe en las juntas de vecinos.\nEsto mismo vemos cuando analizamos los Odds de las regresiones:\n\n\nexp(coef(modelo_1))\n\n  (Intercept) guardia_muni1 \n    0.3084005     0.8018735 \n\nexp(coef(modelo_2))\n\n(Intercept) rec_basura1 \n  0.3127490   0.8733073 \n\nexp(coef(modelo_3))\n\n (Intercept) mant_calles1 \n   0.3391705    0.7469203 \n\nexp(coef(modelo_4))\n\n(Intercept) prot_civil1 \n  0.3401937   0.7561029 \n\nPor ejemplo, cuando una persona tiene una evaluación positiva de la\nguardia municipal, la probabilidad de que participe en una junta de\nvecinos es de 0.8, lo que en términos de probabilidad, significa que\ndisminuye. Este patrón se ve en todas las variables, aunque entre las\nque son significativas (todas menos Recolección de Basura), la que tiene\nun Odd más grande es la evaluación de la Guardia Municipal. En términos\nde comportamiento esto nos indica que las personas tienden a participar\nmás en las juntas de vecinos cuando las evaluaciones de los servicios\npúblicos de la comuna son negativos. Sin embargo, todavía no hemos hecho\nel análisis cruzando los datos con la perpeción de corrupción.\nEsto nos lleva a plantear nuestro modelo que luego va a ser utilizado\nen el resto del trabajo:\n\\[ParticipaciónJuntasdeVecinos = \\alpha +\n\\ Evaluación ServiciosX_1+ \\\\ Participación Elecciónes X_2 + Cohesión\nVecinalX_3 \\\\ Interés en Asuntos Políticos X_4 + Percepción de la\nCorrupción X_5+  \\mu  \\]\nLas variables de Evaluación de Servicios y Cohesión Vecinal serán\níndices. Evaluación de Servicios implican las variables ya evaluadas,\nCohesión Vecinal incluye preguntas respecto a la cantidad de números de\nteléfonos de vecinos que tiene el individuo (n_telefono), si le pide\nayuda a vecinos en casos de necesidad (coop_vecinos) y nivel de\nconfianza en los vecinos (confianza). Interés en Asuntos Políticos se\nmedirá con la variable ‘asuntos’, que pregunta directamente esto y\nParticipación Electoral se pregunta si se voto en las últimas elecciones\nen la variable ‘voto’.\nEn términos de hipótesis, se espera que cuando haya una buena\nEvaluación de Servicios, haya poca probabilidad de participar en juntas\nde vecinos, cuando hay más Cohesión Vecinal, es más probable que\nparticipe en juntas de vecinos, cuando hay Participación Electoral, haya\nmás probabilidad de participar en juntas de vecinos y cuando haya más\nInterés en Asuntos Políticos haya más probabilidad de participar en\njuntas de vecinos.\nDada las experiencias pasadas, que llevaron a estudiar el tema\npresente, se espera que la interacción con Corrupción será más\ncomplicada. Se espera que cuando haya una alta percepción de la\ncorrupción se de vuelta la relación de la Evaluación de Servicios, es\ndecir, cuando haya una Percepción de la Corrupción más alta, el tener\nuna alta Evaluación de Servicios imlpique que sea más probable que\nparticipe el individuo en la junta de vecinos. La lógica tras esta\nhipótesis es que cuando hay una alta corrupción y una mala evaluación de\nlos servicios en la mente del individuo no valga la pena el participar\nen juntas de vecinos, pues no se logrará nada haciéndolo.\n\n\n\n",
    "preview": {},
    "last_modified": "2022-10-26T17:07:49-03:00",
    "input_file": "entrega-4-primeras-regresiones.knit.md"
  },
  {
    "path": "posts/2022-09-01-entrega-1-definiciones/",
    "title": "Entrega 1: definiciones",
    "description": "Primera entrega para el trabajo de ICP5006",
    "author": [
      {
        "name": "Felipe Garrido",
        "url": "https://fgarrido-m.github.io/"
      }
    ],
    "date": "2022-09-01",
    "categories": [
      "Trabajo"
    ],
    "contents": "\nEl trabajo que se desarrollará durante el semestre proviene de un\ninterés tanto en la participación ciudadana, confianza en las\ninstituciones, como la corrupción, en el ámbito de la política\nsubnacional chilena. En la tesis que desarrollé en 2021 se encuentra que\nunas de las potenciales razones para la participación ciudadana en la\ncomuna de Lo Barnechea es la efectividad de la municipalidad para\ncumplir con sus obligaciones, esto a pesar de los casos de corrupción\nconocidos por los vecinos. Esto se contrasta con Estación Central, cuya\npoblación desconfía de la institucionalidad por lo que no participa\nactivamente en espacios como son las juntas de vecinos. Surge la duda\nfinalmente si es que en el resto del territorio chileno se cumple esta\nrelación, es decir, esta dinámica es normal en todas las comunas y\nmunicipalidades de Chile.\nPara esto definimos entonces un número de variables de interés para\neste trabajo:\na) Participación ciudadana\nParticipación ciudadana en estos casos no refiere exclusivamente a la\nparticipación en los espacios clásicos como el voto durante las\nelecciones rutinarias. La idea es medir también la participación en los\nespacios de democracia directa y participativa, como son las juntas de\nvecinos y otras organizaciones de la sociedad civil a nivel local.\nb) Confianza en las\ninstituciones\nUno de los objetivos del trabajo que se buscará durante el semestre\nes encontrar la mejor forma de medir la apreciación de la ciudadanía en\nsus instituciones. En este caso lo que nos interesa es la municipalidad\ny cuales son las apreciaciones de las personas hacia esta política local\ny como es que esta potencialmente afecta la participación ciudadana de\nlos vecinos. Esto finalmente entra dentro del marco de la cultura\npolítica que se puede desarrollar dentro de un subdivisión territorial\ncomo es una comuna, la cultura política se va a entender bajo lo que\nplantean Almond y Verba en su texto clásico de 1980 The Civic\nCulture\nc) Corrupción\nUno de los grandes problemas de la sociedad moderna es la percepción\nde la corrupción en las instituciones democráticas. Sin embargo, dado a\nlo encontrado en mi previa investigación de carácter más cualitativo hay\ncasos en que la corrupción no parece ser un problema sustantivo para los\nvecinos. En este sentido esta variable entra en el estudio con el\nobjetivo de analizar si es que es efectivamente una variable\ninterviniente en la apreciación de las instituciones y en la\nparticipación ciudadana.\n\n\n\n",
    "preview": {},
    "last_modified": "2022-09-08T18:45:06-04:00",
    "input_file": "entrega-1-definiciones.knit.md"
  },
  {
    "path": "posts/2022-08-25-valor-p/",
    "title": "Valor P",
    "description": "Es solo una prueba de lo que se hace en el taller de valor-p",
    "author": [
      {
        "name": "Felipe Garrido",
        "url": "https://fgarrido-m.github.io/"
      }
    ],
    "date": "2022-08-18",
    "categories": [
      "Talleres"
    ],
    "contents": "\n\n\nlibrary(tidyverse)\nlibrary(sjmisc)\nlibrary(haven)\nlibrary(kableExtra)\n\n\n\n\ndf_lapop_chile <- readRDS(\"lapop_chile_220824.rds\")\n\n\n\n\nhistograma <- df_lapop_chile %>% \n  ggplot(aes(x = q2)) +\n  geom_histogram()\n\nhistograma\n\n\n\n\n\ndf_lapop_chile %>% \n  ggplot(aes(x = q2)) +\n  geom_histogram() +\n  facet_grid(~year) +\n  theme_minimal()\n\n\n\n\n\n\n",
    "preview": "posts/2022-08-25-valor-p/valor-p_files/figure-html5/unnamed-chunk-2-1.png",
    "last_modified": "2022-08-25T19:45:21-04:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to paradais",
    "description": "Welcome to our new blog, paradais. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Felipe Garrido",
        "url": "https://fgarrido-m.github.io/"
      }
    ],
    "date": "2022-08-18",
    "categories": [],
    "contents": "\n\n\n\n",
    "preview": {},
    "last_modified": "2022-08-25T19:44:51-04:00",
    "input_file": {}
  }
]
